  [
    {
      "category": "sports",
      "text": "The Olympic Games originated in ancient Greece in 776 BC."
    },
    {
      "category": "sports",
      "text": "Basketball was invented in 1891 by Dr. James Naismith."
    },
    {
      "category": "sports",
      "text": "The FIFA World Cup is the most-watched sporting event in the world."
    },
    {
      "category": "sports",
      "text": "Michael Phelps has won the most Olympic medals in history."
    },
    {
      "category": "sports",
      "text": "A baseball game can theoretically last forever due to the lack of a game clock."
    },
    {
      "category": "sports",
      "text": "The Tour de France is a famous annual men's multiple stage bicycle race."
    },
    {
      "category": "sports",
      "text": "Cricket is the second most popular sport in the world."
    },
    {
      "category": "sports",
      "text": "Tennis balls were originally white, but changed to yellow in 1972 for visibility."
    },
    {
      "category": "sports",
      "text": "The Super Bowl is one of the biggest annual sporting events in the U.S."
    },
    {
      "category": "sports",
      "text": "Golf is the only sport to have been played on the moon."
    },
    {
      "category": "sports",
      "text": "The marathon distance is exactly 26.2 miles or 42.195 kilometers."
    },
    {
      "category": "sports",
      "text": "The fastest serve in tennis was recorded at 163.7 mph by Sam Groth."
    },
    {
      "category": "sports",
      "text": "Sumo wrestling is Japan’s national sport."
    },
    {
      "category": "sports",
      "text": "Table tennis is an Olympic sport since 1988."
    },
    {
      "category": "sports",
      "text": "The longest tennis match lasted 11 hours and 5 minutes."
    },
    {
      "category": "sports",
      "text": "The first recorded baseball game was in 1846."
    },
    {
      "category": "sports",
      "text": "The Stanley Cup is the oldest existing trophy in professional sports in North America."
    },
    {
      "category": "sports",
      "text": "Muhammad Ali was originally named Cassius Clay."
    },
    {
      "category": "sports",
      "text": "The first Winter Olympics were held in 1924 in France."
    },
    {
      "category": "sports",
      "text": "Formula 1 cars can reach speeds of over 230 mph."
    },
    {
      "category": "sports",
      "text": "Gymnastics was part of the first modern Olympic Games in 1896."
    },
    {
      "category": "sports",
      "text": "Roger Federer has won 20 Grand Slam singles titles."
    },
    {
      "category": "sports",
      "text": "The NBA was founded in 1946."
    },
    {
      "category": "sports",
      "text": "The football (soccer) field is called a pitch."
    },
    {
      "category": "sports",
      "text": "The Ashes is a famous cricket series between England and Australia."
    },
    {
      "category": "sports",
      "text": "Wrestling was one of the first sports in ancient Greece."
    },
    {
      "category": "sports",
      "text": "The first Super Bowl was played in 1967."
    },
    {
      "category": "sports",
      "text": "A hockey puck can reach speeds of over 100 mph."
    },
    {
      "category": "sports",
      "text": "Serena Williams has won 23 Grand Slam singles titles."
    },
    {
      "category": "sports",
      "text": "The longest recorded boxing match lasted 7 hours and 19 minutes."
    },
    {
      "category": "sports",
      "text": "The first African to win an Olympic gold medal was Abebe Bikila of Ethiopia."
    },
    {
      "category": "sports",
      "text": "Wayne Gretzky is known as the greatest hockey player of all time."
    },
    {
      "category": "sports",
      "text": "The Olympic flag has five rings representing five continents."
    },
    {
      "category": "sports",
      "text": "Soccer is called football in most of the world."
    },
    {
      "category": "sports",
      "text": "The Boston Marathon is the world’s oldest annual marathon."
    },
    {
      "category": "sports",
      "text": "Skateboarding became an Olympic sport in 2020."
    },
    {
      "category": "sports",
      "text": "Baseball is considered America's pastime."
    },
    {
      "category": "sports",
      "text": "Kabbadi is a popular sport in South Asia."
    },
    {
      "category": "sports",
      "text": "The NFL has 32 teams."
    },
    {
      "category": "sports",
      "text": "Lacrosse is one of the oldest team sports in North America."
    },
    {
      "category": "sports",
      "text": "Chess is considered a sport by the International Olympic Committee."
    },
    {
      "category": "sports",
      "text": "Cricket matches can last up to 5 days."
    },
    {
      "category": "sports",
      "text": "Usain Bolt holds the world record for the 100m sprint."
    },
    {
      "category": "sports",
      "text": "The longest home run ever recorded was 575 feet."
    },
    {
      "category": "sports",
      "text": "In curling, players slide stones on ice toward a target area."
    },
    {
      "category": "sports",
      "text": "The highest-scoring NBA game had 370 total points."
    },
    {
      "category": "sports",
      "text": "Swimming was included in the first modern Olympics in 1896."
    },
    {
      "category": "sports",
      "text": "Volleyball was invented in 1895."
    },
    {
      "category": "sports",
      "text": "Badminton is the fastest racquet sport."
    },
    {
      "category": "sports",
      "text": "Snowboarding became an Olympic sport in 1998."
    },
    {
      "category": "animals",
      "text": "A group of flamingos is called a flamboyance."
    },
    {
      "category": "animals",
      "text": "Octopuses have three hearts and blue blood."
    },
    {
      "category": "animals",
      "text": "A snail can sleep for three years."
    },
    {
      "category": "animals",
      "text": "Elephants are the only animals that can't jump."
    },
    {
      "category": "animals",
      "text": "A group of crows is called a murder."
    },
    {
      "category": "animals",
      "text": "Slugs have four noses."
    },
    {
      "category": "animals",
      "text": "Koalas sleep up to 22 hours a day."
    },
    {
      "category": "animals",
      "text": "Giraffes have the same number of neck vertebrae as humans: seven."
    },
    {
      "category": "animals",
      "text": "Dolphins have names for each other."
    },
    {
      "category": "animals",
      "text": "Cows have best friends and get stressed when separated."
    },
    {
      "category": "animals",
      "text": "A newborn kangaroo is about the size of a lima bean."
    },
    {
      "category": "animals",
      "text": "The heart of a blue whale is as big as a small car."
    },
    {
      "category": "animals",
      "text": "A group of owls is called a parliament."
    },
    {
      "category": "animals",
      "text": "Butterflies can taste with their feet."
    },
    {
      "category": "animals",
      "text": "Sea otters hold hands while sleeping to avoid drifting apart."
    },
    {
      "category": "animals",
      "text": "The fingerprints of a koala are almost identical to humans."
    },
    {
      "category": "animals",
      "text": "Tigers have striped skin, not just striped fur."
    },
    {
      "category": "animals",
      "text": "A baby puffin is called a puffling."
    },
    {
      "category": "animals",
      "text": "Frogs can freeze without dying."
    },
    {
      "category": "animals",
      "text": "Hummingbirds can fly backward."
    },
    {
      "category": "animals",
      "text": "Sharks are older than trees."
    },
    {
      "category": "animals",
      "text": "Ravens are known to mimic human speech."
    },
    {
      "category": "animals",
      "text": "A chameleon's tongue is twice the length of its body."
    },
    {
      "category": "animals",
      "text": "Penguins propose to their mates with pebbles."
    },
    {
      "category": "animals",
      "text": "Male seahorses carry and give birth to babies."
    },
    {
      "category": "animals",
      "text": "A crocodile cannot stick its tongue out."
    },
    {
      "category": "animals",
      "text": "Ants can carry objects 50 times their body weight."
    },
    {
      "category": "animals",
      "text": "Axolotls can regenerate limbs and even parts of their brain."
    },
    {
      "category": "animals",
      "text": "The horn of a rhinoceros is made of keratin, the same as human nails."
    },
    {
      "category": "animals",
      "text": "Tarsiers have eyes bigger than their brains."
    },
    {
      "category": "animals",
      "text": "Bees communicate by dancing."
    },
    {
      "category": "animals",
      "text": "The pistol shrimp can snap its claw fast enough to create a bubble that stuns prey."
    },
    {
      "category": "animals",
      "text": "Owls can't move their eyes, so they rotate their heads up to 270 degrees."
    },
    {
      "category": "animals",
      "text": "A group of hedgehogs is called a prickle."
    },
    {
      "category": "animals",
      "text": "Cats can't taste sweetness."
    },
    {
      "category": "animals",
      "text": "The mantis shrimp has the world’s fastest punch."
    },
    {
      "category": "animals",
      "text": "A giraffe’s tongue can be up to 20 inches long."
    },
    {
      "category": "animals",
      "text": "Sloths can hold their breath longer than dolphins."
    },
    {
      "category": "animals",
      "text": "Crows can recognize human faces."
    },
    {
      "category": "animals",
      "text": "The cheetah is the fastest land animal, capable of speeds up to 70 mph."
    },
    {
      "category": "animals",
      "text": "Jellyfish have been around for over 500 million years."
    },
    {
      "category": "animals",
      "text": "Pandas have six fingers to help them hold bamboo."
    },
    {
      "category": "animals",
      "text": "A group of frogs is called an army."
    },
    {
      "category": "animals",
      "text": "An ostrich's eye is bigger than its brain."
    },
    {
      "category": "animals",
      "text": "Goats have rectangular pupils."
    },
    {
      "category": "animals",
      "text": "Wombat poop is cube-shaped."
    },
    {
      "category": "animals",
      "text": "Tarantulas can survive for over two years without food."
    },
    {
      "category": "animals",
      "text": "Hippopotamus milk is pink."
    },
    {
      "category": "animals",
      "text": "Male lions do as little as 20 minutes of hunting per day."
    },
    {
      "category": "animals",
      "text": "Birds are the closest living relatives to dinosaurs."
    },
    {
      "category": "science",
      "text": "Water can boil and freeze at the same time under the right conditions."
    },
    {
      "category": "science",
      "text": "Lightning is five times hotter than the surface of the sun."
    },
    {
      "category": "science",
      "text": "Bananas are naturally radioactive due to potassium-40."
    },
    {
      "category": "science",
      "text": "Sound travels faster in water than in air."
    },
    {
      "category": "science",
      "text": "A teaspoon of a neutron star would weigh about 6 billion tons."
    },
    {
      "category": "science",
      "text": "The Eiffel Tower can grow more than 6 inches in summer due to heat expansion."
    },
    {
      "category": "science",
      "text": "Light takes 8 minutes and 20 seconds to reach Earth from the sun."
    },
    {
      "category": "science",
      "text": "Carbon is the fourth most abundant element in the universe."
    },
    {
      "category": "science",
      "text": "The human body contains about 37.2 trillion cells."
    },
    {
      "category": "science",
      "text": "DNA was first discovered in 1869."
    },
    {
      "category": "science",
      "text": "Sharks existed before trees."
    },
    {
      "category": "science",
      "text": "Your body has enough iron to make a 3-inch nail."
    },
    {
      "category": "science",
      "text": "An adult human is made up of approximately 60% water."
    },
    {
      "category": "science",
      "text": "Electric eels can generate electric shocks of up to 600 volts."
    },
    {
      "category": "science",
      "text": "The Milky Way galaxy is on a collision course with the Andromeda galaxy."
    },
    {
      "category": "science",
      "text": "There are more atoms in a glass of water than glasses of water in all the oceans on Earth."
    },
    {
      "category": "science",
      "text": "The speed of light is about 299,792 kilometers per second."
    },
    {
      "category": "science",
      "text": "Earth is the only known planet with plate tectonics."
    },
    {
      "category": "science",
      "text": "The human nose can detect over 1 trillion different scents."
    },
    {
      "category": "science",
      "text": "Sound cannot travel through a vacuum."
    },
    {
      "category": "science",
      "text": "Viruses are not classified as living organisms."
    },
    {
      "category": "science",
      "text": "The moon is moving away from Earth at a rate of about 3.8 cm per year."
    },
    {
      "category": "science",
      "text": "Some metals, like gallium, can melt in your hand."
    },
    {
      "category": "science",
      "text": "The universe is about 13.8 billion years old."
    },
    {
      "category": "science",
      "text": "One light-year is about 5.88 trillion miles."
    },
    {
      "category": "science",
      "text": "Photosynthesis produces the oxygen we breathe."
    },
    {
      "category": "science",
      "text": "Black holes can slow down time due to their immense gravity."
    },
    {
      "category": "science",
      "text": "There are 118 known elements in the periodic table."
    },
    {
      "category": "science",
      "text": "The center of Earth is as hot as the surface of the sun."
    },
    {
      "category": "science",
      "text": "The human brain has about 86 billion neurons."
    },
    {
      "category": "science",
      "text": "Tides on Earth are caused by the gravitational pull of the moon."
    },
    {
      "category": "science",
      "text": "Venus rotates in the opposite direction of most planets."
    },
    {
      "category": "science",
      "text": "Antibiotics do not work against viruses."
    },
    {
      "category": "science",
      "text": "The strongest muscle in the human body is the masseter (jaw muscle)."
    },
    {
      "category": "science",
      "text": "Gold is chemically inert and doesn’t rust or tarnish."
    },
    {
      "category": "science",
      "text": "Noble gases are colorless, odorless, and mostly nonreactive."
    },
    {
      "category": "science",
      "text": "Einstein’s famous equation E=mc^2 explains the relationship between mass and energy."
    },
    {
      "category": "science",
      "text": "Humans share about 60% of their DNA with bananas."
    },
    {
      "category": "science",
      "text": "There are more stars in the universe than grains of sand on Earth."
    },
    {
      "category": "science",
      "text": "Absolute zero is the lowest possible temperature, −273.15°C or 0 Kelvin."
    },
    {
      "category": "science",
      "text": "Mercury is the only metal that is liquid at room temperature."
    },
    {
      "category": "science",
      "text": "Saturn is the least dense planet in the solar system."
    },
    {
      "category": "science",
      "text": "Octopuses have three hearts and blue blood due to copper-based hemocyanin."
    },
    {
      "category": "science",
      "text": "Rainbows can actually be full circles, but we typically see only half."
    },
    {
      "category": "science",
      "text": "A day on Venus is longer than a year on Venus."
    },
    {
      "category": "science",
      "text": "The mitochondrion is the powerhouse of the cell."
    },
    {
      "category": "science",
      "text": "The average cloud weighs over a million pounds."
    },
    {
      "category": "science",
      "text": "The periodic table is arranged by increasing atomic number."
    },
    {
      "category": "science",
      "text": "Radio waves have the longest wavelength in the electromagnetic spectrum."
    },
    {
      "category": "science",
      "text": "The speed of sound is approximately 343 m/s in air at room temperature."
    },
    {
      "category": "science",
      "text": "Plants can communicate with each other using chemical signals."
    },
    {
      "category": "science",
      "text": "The Large Hadron Collider is the world’s largest and most powerful particle accelerator."
    },
    {
      "category": "science",
      "text": "Birds are the closest living relatives to dinosaurs."
    },
    {
      "category": "science",
      "text": "Ice is less dense than liquid water, which is why it floats."
    },
    {
      "category": "science",
      "text": "Some fungi glow in the dark due to bioluminescence."
    },
    {
      "category": "science",
      "text": "Halley's Comet returns to Earth every 76 years."
    },
    {
      "category": "science",
      "text": "An octopus can change color and texture to blend into its surroundings."
    },
    {
      "category": "science",
      "text": "A photon is a particle representing a quantum of light."
    },
    {
      "category": "science",
      "text": "Mars has the largest volcano in the solar system, Olympus Mons."
    },
    {
      "category": "science",
      "text": "The Earth’s magnetic field protects it from solar wind."
    },
    {
      "category": "science",
      "text": "Pluto was reclassified from a planet to a dwarf planet in 2006."
    },
    {
      "category": "science",
      "text": "The study of insects is called entomology."
    },
    {
      "category": "science",
      "text": "Humans can distinguish over 10 million different colors."
    },
    {
      "category": "science",
      "text": "A solar eclipse occurs when the moon passes between the Earth and the Sun."
    },
    {
      "category": "science",
      "text": "Thermodynamics is the study of heat and energy transfer."
    },
    {
      "category": "science",
      "text": "A blue moon is the second full moon in a calendar month."
    },
    {
      "category": "science",
      "text": "Comets are made mostly of ice and dust."
    },
    {
      "category": "science",
      "text": "The scientific method involves observation, hypothesis, experimentation, and conclusion."
    },
    {
      "category": "science",
      "text": "Water expands when it freezes, unlike most substances."
    },
    {
      "category": "science",
      "text": "Some turtles can breathe through their butts."
    },
    {
      "category": "science",
      "text": "The heaviest naturally occurring element is uranium."
    },
    {
      "category": "science",
      "text": "The pH scale measures how acidic or basic a substance is."
    },
    {
      "category": "science",
      "text": "Atoms are mostly empty space."
    },
    {
      "category": "science",
      "text": "Lightning can strike the same place more than once."
    },
    {
      "category": "science",
      "text": "Dark matter makes up about 27% of the universe."
    },
    {
      "category": "science",
      "text": "The northern lights are caused by charged particles from the sun interacting with Earth’s atmosphere."
    },
    {
      "category": "science",
      "text": "The Richter scale measures the magnitude of earthquakes."
    },
    {
      "category": "science",
      "text": "Photosynthesis occurs in the chloroplasts of plant cells."
    },
    {
      "category": "science",
      "text": "Blood appears blue in veins because of the way light penetrates the skin."
    },
    {
      "category": "science",
      "text": "You can’t burp in space without vomiting due to the lack of gravity."
    },
    {
      "category": "computer",
      "text": "The first computer programmer was Ada Lovelace in the 1800s."
    },
    {
      "category": "computer",
      "text": "The first electronic computer, ENIAC, weighed more than 27 tons."
    },
    {
      "category": "computer",
      "text": "The term 'bug' in computing came from a real moth found in a computer."
    },
    {
      "category": "computer",
      "text": "The first 1GB hard drive, introduced in 1980, weighed over 500 pounds."
    },
    {
      "category": "computer",
      "text": "Artificial Intelligence was first coined as a term in 1956."
    },
    {
      "category": "computer",
      "text": "Alan Turing is considered the father of theoretical computer science and AI."
    },
    {
      "category": "computer",
      "text": "CAPTCHA stands for 'Completely Automated Public Turing test to tell Computers and Humans Apart'."
    },
    {
      "category": "computer",
      "text": "The first domain ever registered was Symbolics.com in 1985."
    },
    {
      "category": "computer",
      "text": "Quantum computers use qubits instead of bits."
    },
    {
      "category": "computer",
      "text": "Linux is an open-source operating system based on Unix."
    },
    {
      "category": "computer",
      "text": "Deep Blue was the first computer to beat a world chess champion in 1997."
    },
    {
      "category": "computer",
      "text": "Python was named after the comedy series 'Monty Python’s Flying Circus'."
    },
    {
      "category": "computer",
      "text": "Google processes over 8.5 billion searches per day."
    },
    {
      "category": "computer",
      "text": "The average computer virus lasts about 30 minutes before being detected."
    },
    {
      "category": "computer",
      "text": "The first webcam was used to monitor a coffee pot."
    },
    {
      "category": "computer",
      "text": "Moore’s Law predicted the doubling of transistors on microchips every two years."
    },
    {
      "category": "computer",
      "text": "The first email was sent by Ray Tomlinson in 1971."
    },
    {
      "category": "computer",
      "text": "Java was originally called Oak."
    },
    {
      "category": "computer",
      "text": "There are more than 700 programming languages."
    },
    {
      "category": "computer",
      "text": "AI can be categorized as narrow, general, and super AI."
    },
    {
      "category": "computer",
      "text": "The Turing Test evaluates a machine's ability to exhibit intelligent behavior."
    },
    {
      "category": "computer",
      "text": "Cloud computing allows on-demand access to shared computing resources."
    },
    {
      "category": "computer",
      "text": "Blockchain is a decentralized and distributed digital ledger."
    },
    {
      "category": "computer",
      "text": "The first iPhone was released in 2007."
    },
    {
      "category": "computer",
      "text": "The word 'robot' comes from a Czech word meaning 'forced labor'."
    },
    {
      "category": "computer",
      "text": "A bit is the smallest unit of data in a computer."
    },
    {
      "category": "computer",
      "text": "RAM stands for Random Access Memory."
    },
    {
      "category": "computer",
      "text": "The first computer virus was called Creeper."
    },
    {
      "category": "computer",
      "text": "AI models like GPT are based on neural network architectures called transformers."
    },
    {
      "category": "computer",
      "text": "Captcha systems are used to prevent automated bots."
    },
    {
      "category": "computer",
      "text": "The QWERTY keyboard layout was designed in the 1870s."
    },
    {
      "category": "computer",
      "text": "The first spreadsheet program was VisiCalc, released in 1979."
    },
    {
      "category": "computer",
      "text": "HTML stands for HyperText Markup Language."
    },
    {
      "category": "computer",
      "text": "The internet and the World Wide Web are not the same thing."
    },
    {
      "category": "computer",
      "text": "Antivirus software detects and removes malicious software."
    },
    {
      "category": "computer",
      "text": "DNS stands for Domain Name System."
    },
    {
      "category": "computer",
      "text": "A compiler translates code from high-level language to machine language."
    },
    {
      "category": "computer",
      "text": "The 'Blue Screen of Death' is a common Windows error screen."
    },
    {
      "category": "computer",
      "text": "IoT stands for Internet of Things."
    },
    {
      "category": "computer",
      "text": "AI can be trained using supervised, unsupervised, or reinforcement learning."
    },
    {
      "category": "computer",
      "text": "A byte is made up of 8 bits."
    },
    {
      "category": "computer",
      "text": "OpenAI's ChatGPT is based on the GPT architecture."
    },
    {
      "category": "computer",
      "text": "Machine learning is a subset of AI that enables computers to learn from data."
    },
    {
      "category": "computer",
      "text": "A neural network is inspired by the human brain’s structure."
    },
    {
      "category": "computer",
      "text": "The first computer mouse was made of wood."
    },
    {
      "category": "computer",
      "text": "Software is a set of instructions that tells the computer what to do."
    },
    {
      "category": "computer",
      "text": "Hardware refers to the physical parts of a computer."
    },
    {
      "category": "computer",
      "text": "Git is a version control system created by Linus Torvalds."
    },
    {
      "category": "computer",
      "text": "Cookies are small data files used by websites to store user information."
    },
    {
      "category": "computer",
      "text": "JavaScript is a programming language mainly used for web development."
    },
    {
      "category": "computer",
      "text": "SSD stands for Solid State Drive."
    },
    {
      "category": "computer",
      "text": "Python is popular for AI and machine learning due to its simplicity and libraries."
    },
    {
      "category": "computer",
      "text": "CAPTCHA systems are evolving into image-based and audio-based challenges."
    },
    {
      "category": "computer",
      "text": "Natural Language Processing enables computers to understand human language."
    },
    {
      "category": "computer",
      "text": "Big Data refers to extremely large data sets that may be analyzed computationally."
    },
    {
      "category": "computer",
      "text": "AI is being used in healthcare, finance, automotive, and many other sectors."
    },
    {
      "category": "computer",
      "text": "Data mining is the process of discovering patterns in large data sets."
    },
    {
      "category": "computer",
      "text": "Cloud services are typically categorized as IaaS, PaaS, and SaaS."
    },
    {
      "category": "computer",
      "text": "The keyboard shortcut Ctrl+Z is commonly used to undo an action."
    },
    {
      "category": "computer",
      "text": "The computer's CPU is considered its brain."
    },
    {
      "category": "computer",
      "text": "AI can be biased if trained on biased data."
    },
    {
      "category": "computer",
      "text": "Trojans disguise themselves as legitimate software."
    },
    {
      "category": "computer",
      "text": "The first search engine was Archie, created in 1990."
    },
    {
      "category": "computer",
      "text": "Google’s AI AlphaGo defeated a world champion Go player in 2016."
    },
    {
      "category": "computer",
      "text": "Phishing is a technique used to trick users into revealing personal information."
    },
    {
      "category": "computer",
      "text": "A firewall protects networks from unauthorized access."
    },
    {
      "category": "computer",
      "text": "The term 'cybersecurity' refers to protecting systems from digital attacks."
    },
    {
      "category": "computer",
      "text": "Computer graphics are essential for gaming and simulations."
    },
    {
      "category": "computer",
      "text": "Encryption is the process of encoding information to prevent unauthorized access."
    },
    {
      "category": "computer",
      "text": "Quantum computing could revolutionize cryptography."
    },
    {
      "category": "computer",
      "text": "The GPU accelerates rendering of images, videos, and animations."
    },
    {
      "category": "computer",
      "text": "Speech recognition converts spoken language into text."
    },
    {
      "category": "computer",
      "text": "Reinforcement learning allows AI to learn via rewards and penalties."
    },
    {
      "category": "computer",
      "text": "AI can create realistic images and text using generative models."
    },
    {
      "category": "computer",
      "text": "Facial recognition uses AI to identify individuals from images or video."
    },
    {
      "category": "computer",
      "text": "The average smartphone today is more powerful than early space computers."
    },
    {
      "category": "computer",
      "text": "A terabyte is equal to 1,024 gigabytes."
    },
    {
      "category": "computer",
      "text": "Edge computing processes data closer to the source instead of in the cloud."
    },
    {
      "category": "computer",
      "text": "Cybercrime is a growing threat in the digital world."
    },
    {
      "category": "computer",
      "text": "Virtual Reality (VR) immerses users in a simulated environment."
    },
    {
      "category": "human body",
      "text": "The human body contains 206 bones."
    },
    {
      "category": "human body",
      "text": "The largest organ in the human body is the skin."
    },
    {
      "category": "human body",
      "text": "Your brain uses about 20% of your body’s oxygen and calories."
    },
    {
      "category": "human body",
      "text": "The average adult heart beats about 72 times a minute."
    },
    {
      "category": "human body",
      "text": "Humans shed about 600,000 skin particles every hour."
    },
    {
      "category": "human body",
      "text": "The human nose can detect over 1 trillion scents."
    },
    {
      "category": "human body",
      "text": "Blood makes up about 8% of your total body weight."
    },
    {
      "category": "human body",
      "text": "There are about 100,000 miles of blood vessels in the human body."
    },
    {
      "category": "human body",
      "text": "Your liver performs over 500 functions."
    },
    {
      "category": "human body",
      "text": "The human body has more than 600 muscles."
    },
    {
      "category": "human body",
      "text": "The stomach produces a new lining every few days to avoid digesting itself."
    },
    {
      "category": "human body",
      "text": "The strongest muscle in the body relative to its size is the masseter (jaw muscle)."
    },
    {
      "category": "human body",
      "text": "Red blood cells take about 20 seconds to circulate the body."
    },
    {
      "category": "human body",
      "text": "Your bones are about 5 times stronger than steel of the same density."
    },
    {
      "category": "human body",
      "text": "The smallest bone in the body is in the ear and is called the stapes."
    },
    {
      "category": "human body",
      "text": "Your fingernails grow faster on your dominant hand."
    },
    {
      "category": "human body",
      "text": "The human eye can distinguish about 10 million different colors."
    },
    {
      "category": "human body",
      "text": "A person will blink approximately 15–20 times per minute."
    },
    {
      "category": "human body",
      "text": "Taste buds are replaced every 10 to 14 days."
    },
    {
      "category": "human body",
      "text": "The human brain has around 86 billion neurons."
    },
    {
      "category": "human body",
      "text": "Hair is made of a protein called keratin."
    },
    {
      "category": "human body",
      "text": "The lungs contain about 300 million alveoli for gas exchange."
    },
    {
      "category": "human body",
      "text": "The human body has enough iron to make a 3-inch nail."
    },
    {
      "category": "human body",
      "text": "You can't breathe and swallow at the same time."
    },
    {
      "category": "human body",
      "text": "The human spine has 33 vertebrae."
    },
    {
      "category": "human body",
      "text": "The average person has about 5 million hair follicles."
    },
    {
      "category": "human body",
      "text": "Goosebumps are caused by tiny muscles at the base of hair follicles."
    },
    {
      "category": "human body",
      "text": "The human body glows in the dark but it's too faint to be seen by the eye."
    },
    {
      "category": "human body",
      "text": "An adult’s small intestine is about 22 feet long."
    },
    {
      "category": "human body",
      "text": "The average person produces 1 to 1.5 quarts of saliva per day."
    },
    {
      "category": "human body",
      "text": "The human heart can continue beating outside the body if supplied with oxygen."
    },
    {
      "category": "human body",
      "text": "Your ears and nose never stop growing."
    },
    {
      "category": "human body",
      "text": "Human teeth are as strong as shark teeth."
    },
    {
      "category": "human body",
      "text": "The body has over 45 miles of nerves."
    },
    {
      "category": "human body",
      "text": "Sweat itself doesn't smell — bacteria on the skin causes body odor."
    },
    {
      "category": "human body",
      "text": "The left lung is smaller than the right to make room for the heart."
    },
    {
      "category": "human body",
      "text": "Every human has a unique tongue print."
    },
    {
      "category": "human body",
      "text": "The acid in your stomach is strong enough to dissolve metal."
    },
    {
      "category": "human body",
      "text": "Your body contains about 37.2 trillion cells."
    },
    {
      "category": "human body",
      "text": "The average person breathes about 20,000 times per day."
    },
    {
      "category": "human body",
      "text": "You are taller in the morning than at night."
    },
    {
      "category": "human body",
      "text": "The human skeleton regenerates itself every 10 years."
    },
    {
      "category": "human body",
      "text": "Each kidney contains around a million filtering units called nephrons."
    },
    {
      "category": "human body",
      "text": "The body can survive without food for weeks, but only a few days without water."
    },
    {
      "category": "human body",
      "text": "There are over 30 trillion red blood cells in your body at any given time."
    },
    {
      "category": "human body",
      "text": "The human body creates 25 million new cells every second."
    },
    {
      "category": "human body",
      "text": "The average adult human has about 5 liters of blood."
    },
    {
      "category": "human body",
      "text": "A sneeze can travel at speeds over 100 miles per hour."
    },
    {
      "category": "human body",
      "text": "The human brain is about 75% water."
    },
    {
      "category": "human body",
      "text": "Nails grow faster in the summer."
    },
    {
      "category": "human body",
      "text": "Your bones stop growing after puberty but keep repairing."
    },
    {
      "category": "human body",
      "text": "The surface area of the lungs is roughly the size of a tennis court."
    },
    {
      "category": "human body",
      "text": "The human eye has a resolution of about 576 megapixels."
    },
    {
      "category": "human body",
      "text": "Some people are born with extra ribs — a condition called cervical rib."
    },
    {
      "category": "human body",
      "text": "The appendix may play a role in gut immunity."
    },
    {
      "category": "human body",
      "text": "The liver is the only organ that can regenerate."
    },
    {
      "category": "human body",
      "text": "Muscle tissue weighs more than fat tissue."
    },
    {
      "category": "human body",
      "text": "The human body has more bacterial cells than human cells."
    },
    {
      "category": "human body",
      "text": "Your heartbeat can synchronize with the music you listen to."
    },
    {
      "category": "human body",
      "text": "Smiling uses fewer muscles than frowning."
    },
    {
      "category": "human body",
      "text": "About 60% of the human body is water."
    },
    {
      "category": "human body",
      "text": "Your thumb has its own pulse."
    },
    {
      "category": "human body",
      "text": "Your belly button is home to thousands of bacteria."
    },
    {
      "category": "human body",
      "text": "Humans are the only animals with chins."
    },
    {
      "category": "human body",
      "text": "The human body has four types of tissue: epithelial, connective, muscle, and nervous."
    },
    {
      "category": "human body",
      "text": "The average person walks the equivalent of five times around the world in their lifetime."
    },
    {
      "category": "human body",
      "text": "Human bones are constantly being broken down and rebuilt."
    },
    {
      "category": "human body",
      "text": "Your body has a built-in clock called the circadian rhythm."
    },
    {
      "category": "human body",
      "text": "Some people have an extra muscle in their arm called the palmaris longus."
    },
    {
      "category": "human body",
      "text": "The eye can heal itself from a scratch in about 48 hours."
    },
    {
      "category": "human body",
      "text": "The small intestine does most of the digestion and absorption."
    },
    {
      "category": "human body",
      "text": "Your left lung has two lobes, and the right lung has three."
    },
    {
      "category": "human body",
      "text": "Every inch of your skin has about 32 million bacteria on it."
    },
    {
      "category": "human body",
      "text": "You produce new stomach lining every 3 to 4 days."
    },
    {
      "category": "human body",
      "text": "Blood cells are produced in the bone marrow."
    },
    {
      "category": "human body",
      "text": "The tongue is made up of 8 different muscles."
    },
    {
      "category": "human body",
      "text": "Humans have a unique fingerprint — even twins don't share the same."
    },
    {
      "category": "human body",
      "text": "You can’t tickle yourself because your brain predicts the sensation."
    },
    {
      "category": "human body",
      "text": "Your sense of smell is closely tied to memory and emotion."
    },
    {
      "category": "human body",
      "text": "Humans have more than 650 skeletal muscles."
    },

    {
      "category": "computer shortcuts",
      "text": "Ctrl + Z: Undo the last action"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Y: Redo the last undone action"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + C: Copy selected item"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + V: Paste copied item"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + X: Cut selected item"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + A: Select all items"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + S: Save the current document"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + P: Print the current page or document"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + F: Open the Find dialog"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + H: Open the Replace dialog"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + N: Open a new document or window"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + O: Open an existing document"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + W: Close the current window"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Q: Quit the program (varies by application)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + T: Open a new tab (in browsers)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Tab: Switch to the next tab"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + Tab: Switch to the previous tab"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + T: Reopen the last closed tab"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + D: Bookmark the current page (in browsers)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + R: Refresh the page"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + L: Highlight the address bar (in browsers)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Enter: Add 'www.' and '.com' to a URL"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + Delete: Open the clear browsing data dialog"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + F4: Close the active window"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + Tab: Switch between open applications"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + Enter: View properties for the selected item"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + Space: Open the shortcut menu for the active window"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + D: Show or hide the desktop"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + E: Open File Explorer"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + L: Lock your PC"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + R: Open the Run dialog box"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + I: Open Settings"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + Shift + S: Take a screenshot with Snip & Sketch"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + V: Open clipboard history"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + Ctrl + D: Create a new virtual desktop"
    },
    {
      "category": "computer shortcuts",
      "text": "Windows + Ctrl + Left/Right Arrow: Switch between virtual desktops"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + Esc: Open Task Manager"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Alt + Del: Open security options"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Backspace: Delete the previous word"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Delete: Delete the next word"
    },
    {
      "category": "computer shortcuts",
      "text": "Shift + Delete: Permanently delete selected item (bypasses Recycle Bin)"
    },
    {
      "category": "computer shortcuts",
      "text": "F2: Rename selected item"
    },
    {
      "category": "computer shortcuts",
      "text": "F5: Refresh the current window"
    },
    {
      "category": "computer shortcuts",
      "text": "F11: Toggle full-screen mode (in browsers)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + + (Plus): Zoom in"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + - (Minus): Zoom out"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + 0 (Zero): Reset zoom level"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + N: Open a new incognito window (in browsers)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Home: Move to the beginning of a document"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + End: Move to the end of a document"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Left Arrow: Move the cursor one word to the left"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Right Arrow: Move the cursor one word to the right"
    },
    {
      "category": "computer shortcuts",
      "text": "Shift + Arrow Keys: Select text"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + Arrow Keys: Select one word at a time"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Esc: Open Start menu"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + Click: Open program as administrator"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + Left Arrow: Go back (in browsers and File Explorer)"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + Right Arrow: Go forward (in browsers and File Explorer)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + L: Create a bullet point in some editors"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + K: Insert hyperlink (in many editors)"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + U: Underline selected text"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + B: Bold selected text"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + I: Italicize selected text"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + >: Increase font size"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + <: Decrease font size"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + M: Indent paragraph"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + Shift + M: Remove paragraph indent"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + J: Justify text alignment"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + E: Center text alignment"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + L: Left text alignment"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + R: Right text alignment"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + 1: Single line spacing"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + 2: Double line spacing"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + 5: 1.5 line spacing"
    },
    {
      "category": "computer shortcuts",
      "text": "Ctrl + T: Create a hanging indent (in Word)"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + F8: Open Macros dialog (in Word)"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + F: Open File menu"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + E: Open Edit menu (in some programs)"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + V: Open View menu (in some programs)"
    },
    {
      "category": "computer shortcuts",
      "text": "Alt + P: Open Print dialog (in some apps)"
    },
    {
      "category": "bird",
      "text": "Birds can sleep while flying during long migrations."
    },
    {
      "category": "bird",
      "text": "Eagles have eyesight up to 8 times stronger than humans."
    },
    {
      "category": "bird",
      "text": "Some birds, like the cuckoo, lay eggs in other birds' nests."
    },
    {
      "category": "bird",
      "text": "The northern cardinal does not migrate and is often seen in winter."
    },
    {
      "category": "bird",
      "text": "Swifts can stay in the air for months without landing."
    },
    {
      "category": "bird",
      "text": "Some ducks sleep with one eye open and half their brain awake."
    },
    {
      "category": "bird",
      "text": "The laughing kookaburra has a call that sounds like laughter."
    },
    {
      "category": "bird",
      "text": "The African grey parrot is known for its exceptional intelligence."
    },
    {
      "category": "bird",
      "text": "Hummingbirds have the fastest heartbeat of any bird."
    },
    {
      "category": "bird",
      "text": "Birds have hollow bones to reduce weight and aid flight."
    },
    {
      "category": "bird",
      "text": "Male emperor penguins incubate eggs on their feet for two months."
    },
    {
      "category": "bird",
      "text": "The bee hummingbird is the smallest bird, weighing less than a penny."
    },
    {
      "category": "bird",
      "text": "Chickens are the closest living relatives to the Tyrannosaurus rex."
    },
    {
      "category": "bird",
      "text": "Quails lay large clutches of eggs, sometimes up to 15."
    },
    {
      "category": "bird",
      "text": "The southern cassowary can jump 5 feet in the air."
    },
    {
      "category": "bird",
      "text": "Macaws use their beaks like an extra limb to climb."
    },
    {
      "category": "bird",
      "text": "The Hoatzin chick has claws on its wings to climb trees."
    },
    {
      "category": "bird",
      "text": "Many songbirds learn their songs from adult tutors."
    },
    {
      "category": "bird",
      "text": "The male lyrebird can mimic chainsaws, camera shutters, and other birds."
    },
    {
      "category": "bird",
      "text": "The gannet dives into the ocean from heights of over 100 feet."
    },
    {
      "category": "bird",
      "text": "The beak shape often reflects the bird’s diet."
    },
    {
      "category": "bird",
      "text": "The kakapo is a flightless parrot from New Zealand."
    },
    {
      "category": "bird",
      "text": "Robins can hear worms moving underground."
    },
    {
      "category": "bird",
      "text": "The cassowary can be dangerous and has dagger-like claws."
    },
    {
      "category": "bird",
      "text": "Seagulls can drink salt water due to special glands above their eyes."
    },
    {
      "category": "bird",
      "text": "Cranes are symbols of longevity and good fortune in many cultures."
    },
    {
      "category": "bird",
      "text": "Some parrots can live over 80 years."
    },
    {
      "category": "bird",
      "text": "The robin is a national bird of the UK."
    },
    {
      "category": "bird",
      "text": "Birds’ lungs are more efficient than those of mammals."
    },
    {
      "category": "bird",
      "text": "The wandering albatross has the longest wingspan of any bird."
    },
    {
      "category": "bird",
      "text": "Penguins mate for life and take turns incubating eggs."
    },
    {
      "category": "bird",
      "text": "Nightjars are camouflaged to look like tree bark."
    },
    {
      "category": "bird",
      "text": "Toucans have large, colorful bills that help with thermoregulation."
    },
    {
      "category": "bird",
      "text": "The Harpy Eagle can carry prey the size of a monkey."
    },
    {
      "category": "bird",
      "text": "Crows can recognize human faces and hold grudges."
    },
    {
      "category": "bird",
      "text": "Birds like geese and cranes migrate in a V-formation to save energy."
    },
    {
      "category": "bird",
      "text": "Owls can rotate their heads up to 270 degrees."
    },
    {
      "category": "bird",
      "text": "Pigeons were used in both world wars to deliver messages."
    },
    {
      "category": "bird",
      "text": "The ostrich is the largest bird in the world and can't fly."
    },
    {
      "category": "bird",
      "text": "Vultures help the environment by eating dead animals."
    },
    {
      "category": "bird",
      "text": "Male birds often have brighter feathers to attract mates."
    },
    {
      "category": "bird",
      "text": "The weaverbird builds elaborate nests with grass."
    },
    {
      "category": "bird",
      "text": "Peregrine falcons are the fastest birds, diving at speeds over 200 mph."
    },
    {
      "category": "bird",
      "text": "Swans are highly territorial and can be aggressive in breeding season."
    },
    {
      "category": "bird",
      "text": "The kiwi bird lays the largest egg relative to its body size."
    },
    {
      "category": "bird",
      "text": "Albatrosses can stay airborne for hours without flapping their wings."
    },
    {
      "category": "bird",
      "text": "The American woodcock performs an elaborate mating dance in the air."
    },
    {
      "category": "bird",
      "text": "The male bowerbird builds colorful structures to impress mates."
    },
    {
      "category": "bird",
      "text": "Flamingos get their pink color from eating shrimp."
    },
    {
      "category": "bird",
      "text": "The Shoebill Stork has a powerful beak and rarely moves."
    },
    {
      "category": "bird",
      "text": "Snowy owls are excellent hunters and fly silently."
    },
    {
      "category": "bird",
      "text": "Pelicans use their pouch to scoop up fish and water."
    },
    {
      "category": "bird",
      "text": "Ravens can solve complex problems and use tools."
    },
    {
      "category": "bird",
      "text": "Birds were the only dinosaurs to survive the mass extinction."
    },
    {
      "category": "bird",
      "text": "Ostriches have only two toes on each foot."
    },
    {
      "category": "bird",
      "text": "Starlings mimic human speech better than some parrots."
    },
    {
      "category": "bird",
      "text": "Chickens have over 200 distinct noises for communication."
    },
    {
      "category": "bird",
      "text": "A group of flamingos is called a 'flamboyance'."
    },
    {
      "category": "bird",
      "text": "Emus and kangaroos can't walk backwards."
    },
    {
      "category": "bird",
      "text": "Budgies are one of the most popular pet birds worldwide."
    },
    {
      "category": "bird",
      "text": "Birds molt to replace old feathers."
    },
    {
      "category": "bird",
      "text": "Birds can see ultraviolet light, which humans cannot."
    },
    {
      "category": "bird",
      "text": "The Resplendent Quetzal was sacred to ancient Mayans."
    },
    {
      "category": "bird",
      "text": "Cockatoos are known for their strong personalities and vocal mimicry."
    },
    {
      "category": "bird",
      "text": "Birds have a unique organ called the syrinx for singing."
    },
    {
      "category": "bird",
      "text": "Turkeys can blush when they're excited or angry."
    },
    {
      "category": "bird",
      "text": "The song thrush can repeat phrases multiple times in its song."
    },
    {
      "category": "bird",
      "text": "Some birds, like the Arctic Tern, migrate over 40,000 miles a year."
    },
    {
      "category": "bird",
      "text": "Parrots use their tongues to help produce sound."
    },
    {
      "category": "bird",
      "text": "Swans have over 25,000 feathers on their bodies."
    },
    {
      "category": "bird",
      "text": "Some birds cool off by panting, like dogs."
    },
    {
      "category": "bird",
      "text": "The oilbird navigates using echolocation like bats."
    },
    {
      "category": "bird",
      "text": "Roadrunners can run up to 20 mph."
    },
    {
      "category": "bird",
      "text": "Bird feathers are made of keratin, like human nails."
    },
    {
      "category": "bird",
      "text": "The Common Swift can fly continuously for up to 10 months."
    },
    {
      "category": "bird",
      "text": "Owls have asymmetrical ears to help locate prey in the dark."
    },
    {
      "category": "bird",
      "text": "The horned screamer of South America has a long horn-like projection on its head."
    },
    {
      "category": "bird",
      "text": "The Arctic Tern sees more daylight than any other animal."
    },
    {
      "category": "bird",
      "text": "The blue jay can imitate the calls of hawks."
    },
    {
      "category": "bird",
      "text": "Cardinals mate for life and sing duets together."
    },
    {
      "category": "nature",
      "text": "Some trees release chemicals to warn others of insect attacks."
    },
    {
      "category": "nature",
      "text": "Solar flares can disrupt communication and navigation systems."
    },
    {
      "category": "nature",
      "text": "Some plants grow toward light in a process called phototropism."
    },
    {
      "category": "nature",
      "text": "Natural bridges can form from erosion over thousands of years."
    },
    {
      "category": "nature",
      "text": "The Grand Canyon was carved by the Colorado River over millions of years."
    },
    {
      "category": "nature",
      "text": "Sequoia trees are among the largest and oldest trees on Earth."
    },
    {
      "category": "nature",
      "text": "Tornadoes can reach wind speeds of over 300 mph."
    },
    {
      "category": "nature",
      "text": "Waterfalls often form where rivers flow over different rock layers."
    },
    {
      "category": "nature",
      "text": "Wind power is a renewable source of energy harnessed from nature."
    },
    {
      "category": "nature",
      "text": "Caves often house unique species adapted to darkness."
    },
    {
      "category": "nature",
      "text": "Permafrost is ground that remains frozen for two or more years."
    },
    {
      "category": "nature",
      "text": "The desert bloom is a rare phenomenon when deserts explode with flowers after rain."
    },
    {
      "category": "nature",
      "text": "Earthquakes occur due to tectonic plates shifting beneath the Earth’s surface."
    },
    {
      "category": "nature",
      "text": "Some plants can reproduce through cloning, like strawberries."
    },
    {
      "category": "nature",
      "text": "Some mushrooms glow in the dark due to bioluminescence."
    },
    {
      "category": "nature",
      "text": "Limestone is formed from the remains of marine organisms."
    },
    {
      "category": "nature",
      "text": "Lake Baikal in Russia is the deepest and oldest freshwater lake in the world."
    },
    {
      "category": "nature",
      "text": "Some plants, like aloe vera, are used for medicinal purposes."
    },
    {
      "category": "nature",
      "text": "Redwoods can grow over 350 feet tall."
    },
    {
      "category": "nature",
      "text": "Stalactites and stalagmites grow about 0.13 mm a year."
    },
    {
      "category": "nature",
      "text": "Lightning is hotter than the surface of the sun."
    },
    {
      "category": "nature",
      "text": "The blue color of glaciers is due to the dense ice absorbing all colors except blue."
    },
    {
      "category": "nature",
      "text": "Lightning strikes the Earth about 8 million times per day."
    },
    {
      "category": "nature",
      "text": "The Amazon River is the second longest river in the world."
    },
    {
      "category": "nature",
      "text": "The Himalayas are still rising due to tectonic activity."
    },
    {
      "category": "nature",
      "text": "The Northern Lights are also known as Aurora Borealis."
    },
    {
      "category": "nature",
      "text": "The Great Barrier Reef is the largest living structure on Earth."
    },
    {
      "category": "nature",
      "text": "Geysers erupt when underground water is heated and turns to steam."
    },
    {
      "category": "nature",
      "text": "Erosion can form canyons, valleys, and coastlines."
    },
    {
      "category": "nature",
      "text": "The color of leaves changes in fall due to chlorophyll breakdown."
    },
    {
      "category": "nature",
      "text": "Thunderstorms can produce hail, strong winds, and tornadoes."
    },
    {
      "category": "nature",
      "text": "Deserts can be cold, like the Gobi Desert."
    },
    {
      "category": "nature",
      "text": "The tundra biome has a layer of permanently frozen soil."
    },
    {
      "category": "nature",
      "text": "Salt flats are formed when lakes evaporate and leave behind salt."
    },
    {
      "category": "nature",
      "text": "The Earth’s magnetic field protects us from solar radiation."
    },
    {
      "category": "nature",
      "text": "Hot springs contain minerals believed to have healing properties."
    },
    {
      "category": "nature",
      "text": "The smell of rain is caused by a compound called petrichor."
    },
    {
      "category": "nature",
      "text": "Fog is simply a low-lying cloud."
    },
    {
      "category": "nature",
      "text": "Plant roots help prevent soil erosion."
    },
    {
      "category": "nature",
      "text": "Forests cover about 31% of the Earth's land surface."
    },
    {
      "category": "nature",
      "text": "The Amazon has areas that remain unexplored to this day."
    },
    {
      "category": "nature",
      "text": "The Atacama Desert in Chile is one of the driest places on Earth."
    },
    {
      "category": "nature",
      "text": "Lightning can strike the same place multiple times."
    },
    {
      "category": "nature",
      "text": "Bamboo can grow up to 35 inches in a single day."
    },
    {
      "category": "nature",
      "text": "Caves are formed by the dissolution of limestone by water."
    },
    {
      "category": "nature",
      "text": "The sound of thunder is caused by the rapid expansion of air heated by lightning."
    },
    {
      "category": "nature",
      "text": "Monsoons are seasonal winds that bring heavy rains to some regions."
    },
    {
      "category": "nature",
      "text": "Coral reefs support about 25% of all marine life."
    },
    {
      "category": "nature",
      "text": "Some plants, like the Venus flytrap, are carnivorous."
    },
    {
      "category": "nature",
      "text": "Auroras are caused by charged particles from the sun hitting the Earth's atmosphere."
    },
    {
      "category": "nature",
      "text": "Mangroves can survive in saltwater by filtering out salt through their roots."
    },
    {
      "category": "nature",
      "text": "Sand dunes can move and change shape with the wind."
    },
    {
      "category": "nature",
      "text": "Lava flows cool and harden into rock after a volcanic eruption."
    },
    {
      "category": "nature",
      "text": "Glaciers can move, carving valleys and shaping mountains."
    },
    {
      "category": "nature",
      "text": "The Amazon rainforest produces more than 20% of the world’s oxygen."
    },
    {
      "category": "nature",
      "text": "Cacti store water in their thick stems to survive dry conditions."
    },
    {
      "category": "nature",
      "text": "Bioluminescent bays glow due to microorganisms in the water."
    },
    {
      "category": "nature",
      "text": "Some animals use natural camouflage to blend with surroundings."
    },
    {
      "category": "nature",
      "text": "Moss can grow in harsh environments and is often one of the first plants to colonize bare land."
    },
    {
      "category": "nature",
      "text": "Biomes are large areas with similar climate and ecosystem types."
    },
    {
      "category": "nature",
      "text": "The Sahara Desert was once a lush green landscape."
    },
    {
      "category": "nature",
      "text": "Mount Everest grows approximately 4 millimeters every year."
    },
    {
      "category": "nature",
      "text": "Sunflowers can track the movement of the sun throughout the day."
    },
    {
      "category": "nature",
      "text": "Volcanic soil is very fertile and good for farming."
    },
    {
      "category": "nature",
      "text": "Fireflies produce light through a chemical reaction in their bodies."
    },
    {
      "category": "nature",
      "text": "Some species of fungi can break down plastic."
    },
    {
      "category": "nature",
      "text": "The ozone layer absorbs most of the sun’s harmful UV rays."
    },
    {
      "category": "nature",
      "text": "Rainbows are full circles, but we usually see only half from the ground."
    },
    {
      "category": "nature",
      "text": "Trees can communicate with each other through underground fungal networks."
    },
    {
      "category": "nature",
      "text": "Eclipses occur when the sun, moon, and Earth align."
    },
    {
      "category": "nature",
      "text": "Natural erosion is a slow process but can reshape entire landscapes."
    },
    {
      "category": "nature",
      "text": "Volcanoes can create new landmasses, like the Hawaiian Islands."
    },
    {
      "category": "nature",
      "text": "A single tree can absorb up to 48 pounds of carbon dioxide per year."
    },
    {
      "category": "nature",
      "text": "Trees grow rings each year that can tell their age and climate conditions."
    },
    {
      "category": "nature",
      "text": "The Earth rotates on its axis once every 24 hours."
    },
    {
      "category": "nature",
      "text": "Natural selection shapes how species adapt to their environment."
    },
    {
      "category": "nature",
      "text": "The Earth’s crust is divided into large tectonic plates."
    },
    {
      "category": "nature",
      "text": "The Mariana Trench is the deepest part of the ocean."
    },
    {
      "category": "nature",
      "text": "The Dead Sea is so salty that people can float easily in it."
    },
    {
      "category": "nature",
      "text": "Tsunamis are often caused by underwater earthquakes."
    },
    {
      "category": "world",
      "text": "The Great Fire of London occurred in 1666."
    },
    {
      "category": "world",
      "text": "The Dead Sea is the lowest point on Earth’s surface."
    },
    {
      "category": "world",
      "text": "The Amazon River is second only to the Nile in length."
    },
    {
      "category": "world",
      "text": "The tallest building in the world is the Burj Khalifa in Dubai."
    },
    {
      "category": "world",
      "text": "The Leaning Tower of Pisa took nearly 200 years to complete."
    },
    {
      "category": "world",
      "text": "Nelson Mandela became South Africa's first black president in 1994."
    },
    {
      "category": "world",
      "text": "The World Health Organization was established in 1948."
    },
    {
      "category": "world",
      "text": "World War II ended in 1945."
    },
    {
      "category": "world",
      "text": "The Lusitania sinking in 1915 influenced the US entry into WWI."
    },
    {
      "category": "world",
      "text": "Stonehenge was built around 3000 BC in England."
    },
    {
      "category": "world",
      "text": "The first human civilization emerged in Mesopotamia."
    },
    {
      "category": "world",
      "text": "The Cuban Missile Crisis occurred in 1962."
    },
    {
      "category": "world",
      "text": "The Apollo 11 mission was the first to land humans on the Moon."
    },
    {
      "category": "world",
      "text": "The 2004 Indian Ocean tsunami killed over 230,000 people."
    },
    {
      "category": "world",
      "text": "The Inca Empire built an extensive road system in South America."
    },
    {
      "category": "world",
      "text": "Vikings explored parts of North America around 1000 AD."
    },
    {
      "category": "world",
      "text": "The Silk Road connected China to Europe for trade."
    },
    {
      "category": "world",
      "text": "The Berlin Wall separated East and West Berlin for 28 years."
    },
    {
      "category": "world",
      "text": "The fall of Constantinople happened in 1453."
    },
    {
      "category": "world",
      "text": "Machu Picchu was rediscovered in 1911."
    },
    {
      "category": "world",
      "text": "The French Revolution began in 1789."
    },
    {
      "category": "world",
      "text": "The Korean War began in 1950."
    },
    {
      "category": "world",
      "text": "The Hubble Space Telescope was launched in 1990."
    },
    {
      "category": "world",
      "text": "The Colosseum in Rome could hold up to 80,000 spectators."
    },
    {
      "category": "world",
      "text": "The Age of Exploration began in the 15th century."
    },
    {
      "category": "world",
      "text": "The Great Chicago Fire destroyed over 3 square miles of the city."
    },
    {
      "category": "world",
      "text": "The Eiffel Tower was completed in 1889 in Paris, France."
    },
    {
      "category": "world",
      "text": "The Renaissance began in Italy during the 14th century."
    },
    {
      "category": "world",
      "text": "The Pyramids of Giza are over 4,500 years old."
    },
    {
      "category": "world",
      "text": "The Euro was introduced as currency in 1999."
    },
    {
      "category": "world",
      "text": "The Titanic sank in 1912 after hitting an iceberg."
    },
    {
      "category": "world",
      "text": "The Geneva Conventions define humanitarian rights during war."
    },
    {
      "category": "world",
      "text": "The first iPhone was released in 2007."
    },
    {
      "category": "world",
      "text": "The first known writing system was cuneiform from Mesopotamia."
    },
    {
      "category": "world",
      "text": "Antarctica is the coldest continent on Earth."
    },
    {
      "category": "world",
      "text": "The Pacific Ocean is the largest and deepest ocean on Earth."
    },
    {
      "category": "world",
      "text": "The British Empire was once the largest in history."
    },
    {
      "category": "world",
      "text": "The Black Death killed millions in the 14th century."
    },
    {
      "category": "world",
      "text": "China has the world’s largest population."
    },
    {
      "category": "world",
      "text": "The Parthenon in Greece was dedicated to Athena."
    },
    {
      "category": "world",
      "text": "Mount Everest is the highest mountain above sea level."
    },
    {
      "category": "world",
      "text": "Russia is the largest country in the world by area."
    },
    {
      "category": "world",
      "text": "The Great Barrier Reef is visible from space."
    },
    {
      "category": "world",
      "text": "World War I lasted from 1914 to 1918."
    },
    {
      "category": "world",
      "text": "World War I introduced tanks and chemical warfare."
    },
    {
      "category": "world",
      "text": "The first man landed on the Moon in 1969."
    },
    {
      "category": "world",
      "text": "The Berlin Wall stood from 1961 to 1989."
    },
    {
      "category": "world",
      "text": "The Cold War lasted from 1947 to 1991."
    },
    {
      "category": "world",
      "text": "The Russian Revolution occurred in 1917."
    },
    {
      "category": "world",
      "text": "The European Union was established in 1993."
    },
    {
      "category": "world",
      "text": "The Berlin Wall fell in 1989."
    },
    {
      "category": "world",
      "text": "The Amazon rainforest is the largest rainforest on Earth."
    },
    {
      "category": "world",
      "text": "The Great Wall was built over several dynasties for defense."
    },
    {
      "category": "world",
      "text": "The currency of Japan is the Yen."
    },
    {
      "category": "world",
      "text": "The Panama Canal connects the Atlantic and Pacific Oceans."
    },
    {
      "category": "world",
      "text": "The US dropped atomic bombs on Hiroshima and Nagasaki in 1945."
    },
    {
      "category": "world",
      "text": "The Kyoto Protocol was adopted in 1997 to combat climate change."
    },
    {
      "category": "world",
      "text": "The Sahara is the largest hot desert in the world."
    },
    {
      "category": "world",
      "text": "The Industrial Revolution began in the 18th century."
    },
    {
      "category": "world",
      "text": "The Great Famine in Ireland occurred between 1845 and 1852."
    },
    {
      "category": "world",
      "text": "The Great Depression began in 1929."
    },
    {
      "category": "world",
      "text": "The Olympics originated in ancient Greece in 776 BC."
    },
    {
      "category": "world",
      "text": "The Great Wall of China is more than 13,000 miles long."
    },
    {
      "category": "world",
      "text": "The Wright brothers flew the first powered airplane in 1903."
    },
    {
      "category": "world",
      "text": "The United States declared independence in 1776."
    },
    {
      "category": "world",
      "text": "The Roman Empire lasted for over a thousand years."
    },
    {
      "category": "world",
      "text": "The Berlin Conference of 1884 divided Africa among European powers."
    },
    {
      "category": "world",
      "text": "The United Nations was founded in 1945."
    },
    {
      "category": "world",
      "text": "Canada has the longest coastline in the world."
    },
    {
      "category": "world",
      "text": "The Aztecs built their capital on a lake in Mexico."
    },
    {
      "category": "world",
      "text": "New Zealand was the first country to give women the right to vote."
    },
    {
      "category": "world",
      "text": "The Suez Canal was completed in 1869."
    },
    {
      "category": "world",
      "text": "The world’s first programmable computer was created in Germany in 1941."
    },
    {
      "category": "world",
      "text": "The Internet became publicly available in 1991."
    },
    {
      "category": "world",
      "text": "Greenwich, England, is the location of the Prime Meridian."
    },
    {
      "category": "world",
      "text": "The first World Expo was held in London in 1851."
    },
    {
      "category": "world",
      "text": "The first printed book was the Gutenberg Bible in the 1450s."
    },
    {
      "category": "world",
      "text": "The Olympic Games were revived in 1896 in Athens, Greece."
    },
    {
      "category": "world",
      "text": "The moon is slowly drifting away from Earth."
    },
    {
      "category": "world",
      "text": "The Eiffel Tower was once the tallest structure in the world."
    },
    {
      "category": "literature",
      "text": "William Shakespeare invented over 1,700 English words."
    },
    {
      "category": "literature",
      "text": "The first novel ever written is considered to be 'The Tale of Genji' by Murasaki Shikibu in the 11th century."
    },
    {
      "category": "literature",
      "text": "Dr. Seuss’s real name was Theodor Seuss Geisel."
    },
    {
      "category": "literature",
      "text": "The Harry Potter series has sold over 500 million copies worldwide."
    },
    {
      "category": "literature",
      "text": "The longest novel ever written is 'In Search of Lost Time' by Marcel Proust."
    },
    {
      "category": "literature",
      "text": "J.R.R. Tolkien wrote 'The Lord of the Rings' as a sequel to 'The Hobbit'."
    },
    {
      "category": "literature",
      "text": "Agatha Christie is the best-selling novelist of all time."
    },
    {
      "category": "literature",
      "text": "The Bible is the most widely distributed book in the world."
    },
    {
      "category": "literature",
      "text": "The first book ever printed was the Gutenberg Bible."
    },
    {
      "category": "literature",
      "text": "Ernest Hemingway wrote many of his novels standing up."
    },
    {
      "category": "literature",
      "text": "Jane Austen published her books anonymously during her lifetime."
    },
    {
      "category": "literature",
      "text": "Mark Twain’s real name was Samuel Langhorne Clemens."
    },
    {
      "category": "literature",
      "text": "George Orwell’s real name was Eric Arthur Blair."
    },
    {
      "category": "literature",
      "text": "The word 'robot' was first used in a play by Karel Čapek in 1920."
    },
    {
      "category": "literature",
      "text": "The average reader reads about 200 to 300 words per minute."
    },
    {
      "category": "literature",
      "text": "There are over 130 million published books in the world."
    },
    {
      "category": "literature",
      "text": "‘Don Quixote’ by Miguel de Cervantes is considered the first modern novel."
    },
    {
      "category": "literature",
      "text": "The 'Iliad' and the 'Odyssey' are attributed to the Greek poet Homer."
    },
    {
      "category": "literature",
      "text": "Leo Tolstoy’s 'War and Peace' contains over 500 characters."
    },
    {
      "category": "literature",
      "text": "‘Moby-Dick’ was a commercial failure during Herman Melville’s lifetime."
    },
    {
      "category": "literature",
      "text": "The Nobel Prize in Literature was first awarded in 1901."
    },
    {
      "category": "literature",
      "text": "Louisa May Alcott originally published 'Little Women' in two volumes."
    },
    {
      "category": "literature",
      "text": "Charles Dickens wrote 'A Christmas Carol' in just six weeks."
    },
    {
      "category": "literature",
      "text": "The term 'science fiction' was popularized in the 1920s."
    },
    {
      "category": "literature",
      "text": "Many of Edgar Allan Poe’s stories deal with themes of death and madness."
    },
    {
      "category": "literature",
      "text": "‘The Catcher in the Rye’ was originally published for adults."
    },
    {
      "category": "literature",
      "text": "Emily Dickinson wrote nearly 1,800 poems but only a few were published during her life."
    },
    {
      "category": "literature",
      "text": "F. Scott Fitzgerald died thinking he was a failure, unaware his work would be highly regarded."
    },
    {
      "category": "literature",
      "text": "Toni Morrison was the first African American woman to win the Nobel Prize in Literature."
    },
    {
      "category": "literature",
      "text": "‘To Kill a Mockingbird’ won the Pulitzer Prize in 1961."
    },
    {
      "category": "literature",
      "text": "J.K. Rowling was rejected by 12 publishers before 'Harry Potter' was accepted."
    },
    {
      "category": "literature",
      "text": "Stephen King threw away the manuscript of 'Carrie'; his wife rescued it."
    },
    {
      "category": "literature",
      "text": "The Oxford English Dictionary took over 70 years to complete."
    },
    {
      "category": "literature",
      "text": "Beatrix Potter self-published 'The Tale of Peter Rabbit' after being rejected by publishers."
    },
    {
      "category": "literature",
      "text": "The term 'bookworm' dates back to the 1500s."
    },
    {
      "category": "literature",
      "text": "William Faulkner wrote ‘As I Lay Dying’ in six weeks while working at a power plant."
    },
    {
      "category": "literature",
      "text": "George R.R. Martin was inspired by historical events for 'Game of Thrones'."
    },
    {
      "category": "literature",
      "text": "‘Frankenstein’ was written by Mary Shelley when she was just 18 years old."
    },
    {
      "category": "literature",
      "text": "Oscar Wilde is known for his sharp wit and epigrams."
    },
    {
      "category": "literature",
      "text": "Gabriel García Márquez popularized magical realism in literature."
    },
    {
      "category": "literature",
      "text": "Dante’s 'Divine Comedy' is considered a masterpiece of Italian literature."
    },
    {
      "category": "literature",
      "text": "Haruki Murakami is known for blending surrealism with everyday life."
    },
    {
      "category": "literature",
      "text": "Virginia Woolf was a central figure in the Bloomsbury Group of writers and artists."
    },
    {
      "category": "literature",
      "text": "Sylvia Plath’s 'The Bell Jar' is a semi-autobiographical novel."
    },
    {
      "category": "literature",
      "text": "Cormac McCarthy rarely used punctuation in his novels."
    },
    {
      "category": "literature",
      "text": "The 'Little Prince' is one of the most translated books in the world."
    },
    {
      "category": "literature",
      "text": "‘Ulysses’ by James Joyce was banned in the U.S. until 1933."
    },
    {
      "category": "literature",
      "text": "The Brontë sisters originally published under male pseudonyms."
    },
    {
      "category": "literature",
      "text": "Margaret Atwood wrote parts of 'The Handmaid’s Tale' on a typewriter."
    },
    {
      "category": "literature",
      "text": "‘The Hobbit’ was published in 1937."
    },
    {
      "category": "literature",
      "text": "Neil Gaiman blends mythology and fantasy in his writing."
    },
    {
      "category": "literature",
      "text": "Roald Dahl served as a fighter pilot in WWII before becoming a writer."
    },
    {
      "category": "literature",
      "text": "Kurt Vonnegut’s style often mixes satire and science fiction."
    },
    {
      "category": "literature",
      "text": "T.S. Eliot’s 'The Waste Land' is a landmark of modernist poetry."
    },
    {
      "category": "literature",
      "text": "Emily Brontë wrote only one novel: ‘Wuthering Heights’."
    },
    {
      "category": "literature",
      "text": "‘The Great Gatsby’ was not widely read until after Fitzgerald’s death."
    },
    {
      "category": "literature",
      "text": "Tolkien created multiple languages for the world of Middle-earth."
    },
    {
      "category": "literature",
      "text": "The Booker Prize is one of the most prestigious literary awards."
    },
    {
      "category": "literature",
      "text": "Many classic authors struggled financially during their lifetimes."
    },
    {
      "category": "literature",
      "text": "Audiobooks are a rapidly growing segment in the publishing industry."
    },
    {
      "category": "literature",
      "text": "Censorship has affected the publication of many famous works."
    },
    {
      "category": "literature",
      "text": "The 'Epic of Gilgamesh' is one of the oldest known works of literature."
    },
    {
      "category": "literature",
      "text": "Many fairy tales have darker original versions than modern retellings."
    },
    {
      "category": "literature",
      "text": "Comic books and graphic novels are increasingly recognized as literature."
    },
    {
      "category": "literature",
      "text": "Libraries are a critical part of literature access and preservation."
    },
    {
      "category": "literature",
      "text": "Haikus are a traditional form of Japanese poetry with 3 lines."
    },
    {
      "category": "literature",
      "text": "Many bestsellers are ghostwritten by professional writers."
    },
    {
      "category": "literature",
      "text": "Self-publishing has become more accessible through digital platforms."
    },
    {
      "category": "literature",
      "text": "Books have been burned as acts of censorship throughout history."
    },
    {
      "category": "literature",
      "text": "‘1984’ and ‘Brave New World’ are dystopian literature classics."
    },
    {
      "category": "literature",
      "text": "The term 'literature' covers prose, poetry, and drama."
    },
    {
      "category": "literature",
      "text": "National libraries preserve the cultural heritage of literature."
    },
    {
      "category": "literature",
      "text": "Fan fiction allows readers to expand on existing literary worlds."
    },
    {
      "category": "literature",
      "text": "Paperbacks made books more affordable in the 20th century."
    },
    {
      "category": "literature",
      "text": "Poetry slams are competitive spoken word events."
    },
    {
      "category": "literature",
      "text": "Some authors write under multiple pseudonyms."
    },
    {
      "category": "literature",
      "text": "Literary genres continue to evolve with time and technology."
    },
    {
      "category": "literature",
      "text": "Book translations allow access to stories across languages."
    },
    {
      "category": "literature",
      "text": "‘Les Misérables’ by Victor Hugo is over 1,400 pages long."
    },
    {
      "category": "literature",
      "text": "Many authors find inspiration from travel and life experiences."
    },
    {
      "category": "health",
      "text": "Drinking enough water each day helps maintain energy levels and brain function."
    },
    {
      "category": "health",
      "text": "Regular physical activity can reduce the risk of chronic diseases like diabetes and heart disease."
    },
    {
      "category": "health",
      "text": "Sleep is essential for mental health and immune system support."
    },
    {
      "category": "health",
      "text": "Excessive sugar intake is linked to increased risk of obesity and heart disease."
    },
    {
      "category": "health",
      "text": "The human body is about 60% water."
    },
    {
      "category": "health",
      "text": "Vitamin D is produced when your skin is exposed to sunlight."
    },
    {
      "category": "health",
      "text": "Handwashing with soap can reduce the spread of infectious diseases."
    },
    {
      "category": "health",
      "text": "Fiber-rich foods help support healthy digestion."
    },
    {
      "category": "health",
      "text": "Smoking is the leading preventable cause of death worldwide."
    },
    {
      "category": "health",
      "text": "A balanced diet includes carbohydrates, proteins, fats, vitamins, and minerals."
    },
    {
      "category": "health",
      "text": "Too much screen time can lead to eye strain and sleep issues."
    },
    {
      "category": "health",
      "text": "Mental health is just as important as physical health."
    },
    {
      "category": "health",
      "text": "Laughter can boost your immune system and improve mood."
    },
    {
      "category": "health",
      "text": "Chronic stress can negatively impact the heart, brain, and immune system."
    },
    {
      "category": "health",
      "text": "Walking just 30 minutes a day can improve cardiovascular health."
    },
    {
      "category": "health",
      "text": "Excess salt intake can lead to high blood pressure."
    },
    {
      "category": "health",
      "text": "Staying socially connected supports mental health."
    },
    {
      "category": "health",
      "text": "Processed foods often contain unhealthy levels of sodium and sugar."
    },
    {
      "category": "health",
      "text": "Drinking green tea can improve brain function and fat burning."
    },
    {
      "category": "health",
      "text": "Deep breathing can reduce stress and lower blood pressure."
    },
    {
      "category": "health",
      "text": "Hydration is crucial for kidney health."
    },
    {
      "category": "health",
      "text": "Regular dental checkups help prevent gum disease and tooth loss."
    },
    {
      "category": "health",
      "text": "Moderate sun exposure helps produce Vitamin D, but too much increases skin cancer risk."
    },
    {
      "category": "health",
      "text": "High cholesterol can lead to atherosclerosis and heart attacks."
    },
    {
      "category": "health",
      "text": "An adult should aim for 7–9 hours of sleep per night."
    },
    {
      "category": "health",
      "text": "Exercise improves mood by releasing endorphins."
    },
    {
      "category": "health",
      "text": "Obesity is associated with increased risk of over 50 health conditions."
    },
    {
      "category": "health",
      "text": "Too much alcohol can damage the liver and brain."
    },
    {
      "category": "health",
      "text": "Yoga and meditation can help manage anxiety and depression."
    },
    {
      "category": "health",
      "text": "Good posture reduces back pain and improves breathing."
    },
    {
      "category": "health",
      "text": "Antioxidants help protect the body from free radicals."
    },
    {
      "category": "health",
      "text": "Sitting for long periods increases the risk of blood clots and metabolic issues."
    },
    {
      "category": "health",
      "text": "Leafy greens are rich in iron, calcium, and other nutrients."
    },
    {
      "category": "health",
      "text": "Children need more sleep than adults for healthy growth and development."
    },
    {
      "category": "health",
      "text": "Eating breakfast can help regulate metabolism and energy levels."
    },
    {
      "category": "health",
      "text": "Trans fats are considered the worst type of fat for health."
    },
    {
      "category": "health",
      "text": "Too much caffeine can cause anxiety, insomnia, and increased heart rate."
    },
    {
      "category": "health",
      "text": "Breastfeeding has benefits for both infants and mothers."
    },
    {
      "category": "health",
      "text": "Maintaining a healthy weight can improve overall longevity."
    },
    {
      "category": "health",
      "text": "Fruits and vegetables are rich in essential vitamins and minerals."
    },
    {
      "category": "health",
      "text": "Hygiene practices like brushing teeth and showering reduce illness."
    },
    {
      "category": "health",
      "text": "High blood pressure is often called the “silent killer.”"
    },
    {
      "category": "health",
      "text": "Stretching regularly improves flexibility and reduces injury risk."
    },
    {
      "category": "health",
      "text": "Vaccinations prevent deadly diseases and protect community health."
    },
    {
      "category": "health",
      "text": "Chronic inflammation is linked to many serious illnesses."
    },
    {
      "category": "health",
      "text": "Spending time in nature reduces stress and improves mental health."
    },
    {
      "category": "health",
      "text": "Whole grains are healthier than refined grains."
    },
    {
      "category": "health",
      "text": "High protein diets can support muscle growth and fat loss."
    },
    {
      "category": "health",
      "text": "Smoking can impair lung function even in light or occasional smokers."
    },
    {
      "category": "health",
      "text": "Prolonged stress may suppress immune function over time."
    },
    {
      "category": "health",
      "text": "Good sleep hygiene improves sleep quality and daytime focus."
    },
    {
      "category": "health",
      "text": "Omega-3 fatty acids support heart and brain health."
    },
    {
      "category": "health",
      "text": "Sunscreen helps prevent skin damage and skin cancer."
    },
    {
      "category": "health",
      "text": "Proper hydration helps regulate body temperature."
    },
    {
      "category": "health",
      "text": "Iron is essential for transporting oxygen in the blood."
    },
    {
      "category": "health",
      "text": "Mental health disorders affect 1 in 4 people globally."
    },
    {
      "category": "health",
      "text": "Anemia is a condition caused by lack of red blood cells or hemoglobin."
    },
    {
      "category": "health",
      "text": "Exercising outdoors provides Vitamin D and fresh air benefits."
    },
    {
      "category": "health",
      "text": "Zinc is vital for immune health and wound healing."
    },
    {
      "category": "health",
      "text": "Too little sleep is associated with higher risk of chronic illness."
    },
    {
      "category": "health",
      "text": "Calcium strengthens bones and teeth."
    },
    {
      "category": "health",
      "text": "Washing fruits and vegetables helps reduce pesticide exposure."
    },
    {
      "category": "health",
      "text": "Diets high in fruits and vegetables may lower risk of many diseases."
    },
    {
      "category": "health",
      "text": "Good hygiene helps prevent the spread of bacteria and viruses."
    },
    {
      "category": "health",
      "text": "Nuts and seeds are excellent sources of healthy fats and protein."
    },
    {
      "category": "health",
      "text": "Weight-bearing exercise helps maintain bone density."
    },
    {
      "category": "health",
      "text": "Unmanaged diabetes can damage nerves, eyes, kidneys, and heart."
    },
    {
      "category": "health",
      "text": "Cholesterol is essential for hormone production but must be balanced."
    },
    {
      "category": "health",
      "text": "Moderate caffeine can improve focus and mood."
    },
    {
      "category": "health",
      "text": "High sugar intake contributes to insulin resistance."
    },
    {
      "category": "health",
      "text": "Dark chocolate contains antioxidants and may support heart health."
    },
    {
      "category": "health",
      "text": "An active lifestyle reduces risk of Alzheimer’s and dementia."
    },
    {
      "category": "health",
      "text": "Mindful eating helps with digestion and weight control."
    },
    {
      "category": "health",
      "text": "Bacteria in your gut play a key role in health and immunity."
    },
    {
      "category": "health",
      "text": "Exercise reduces the risk of stroke and certain cancers."
    },
    {
      "category": "health",
      "text": "Fasting has shown benefits in metabolism and cellular repair."
    },
    {
      "category": "health",
      "text": "Allergies are overreactions of the immune system to harmless substances."
    },
    {
      "category": "health",
      "text": "Eye exams help detect conditions like glaucoma early."
    },
    {
      "category": "health",
      "text": "Low vitamin B12 can cause fatigue, weakness, and nerve issues."
    },
    {
      "category": "health",
      "text": "Social isolation is linked to poorer health outcomes."
    },
    {
      "category": "biology",
      "text": "The human genome contains around 3 billion base pairs of DNA."
    },
    {
      "category": "biology",
      "text": "Mitochondria are known as the powerhouse of the cell."
    },
    {
      "category": "biology",
      "text": "DNA stands for deoxyribonucleic acid."
    },
    {
      "category": "biology",
      "text": "Photosynthesis occurs in the chloroplasts of plant cells."
    },
    {
      "category": "biology",
      "text": "Red blood cells transport oxygen throughout the body."
    },
    {
      "category": "biology",
      "text": "The cell is the basic structural and functional unit of life."
    },
    {
      "category": "biology",
      "text": "Enzymes are biological catalysts that speed up chemical reactions."
    },
    {
      "category": "biology",
      "text": "Humans share approximately 98% of their DNA with chimpanzees."
    },
    {
      "category": "biology",
      "text": "The heart beats about 100,000 times per day."
    },
    {
      "category": "biology",
      "text": "The human body has over 600 muscles."
    },
    {
      "category": "biology",
      "text": "The brain contains around 86 billion neurons."
    },
    {
      "category": "biology",
      "text": "Bacteria can reproduce as quickly as every 20 minutes under optimal conditions."
    },
    {
      "category": "biology",
      "text": "The human body has 206 bones in adulthood."
    },
    {
      "category": "biology",
      "text": "Fungi are more closely related to animals than to plants."
    },
    {
      "category": "biology",
      "text": "Genes are segments of DNA that code for proteins."
    },
    {
      "category": "biology",
      "text": "Viruses are not considered living organisms."
    },
    {
      "category": "biology",
      "text": "Antibodies are produced by the immune system to fight pathogens."
    },
    {
      "category": "biology",
      "text": "Stem cells can develop into many different types of cells."
    },
    {
      "category": "biology",
      "text": "Evolution is the change in heritable traits in populations over generations."
    },
    {
      "category": "biology",
      "text": "Charles Darwin developed the theory of natural selection."
    },
    {
      "category": "biology",
      "text": "Blood is made up of red cells, white cells, platelets, and plasma."
    },
    {
      "category": "biology",
      "text": "The liver is the largest internal organ in the human body."
    },
    {
      "category": "biology",
      "text": "A single human cell contains about 20,000–25,000 genes."
    },
    {
      "category": "biology",
      "text": "The lungs are responsible for gas exchange in the body."
    },
    {
      "category": "biology",
      "text": "The human eye can distinguish about 10 million different colors."
    },
    {
      "category": "biology",
      "text": "Genetics is the study of heredity and variation in organisms."
    },
    {
      "category": "biology",
      "text": "The nucleus of a cell contains the genetic material."
    },
    {
      "category": "biology",
      "text": "Heredity is the passing of traits from parents to offspring."
    },
    {
      "category": "biology",
      "text": "The circulatory system transports blood and nutrients throughout the body."
    },
    {
      "category": "biology",
      "text": "All living things are made up of cells."
    },
    {
      "category": "biology",
      "text": "Hormones are chemical messengers in the body."
    },
    {
      "category": "biology",
      "text": "The pancreas produces insulin to regulate blood sugar levels."
    },
    {
      "category": "biology",
      "text": "The small intestine is where most nutrient absorption takes place."
    },
    {
      "category": "biology",
      "text": "Proteins are made up of amino acids."
    },
    {
      "category": "biology",
      "text": "Chlorophyll gives plants their green color and is essential for photosynthesis."
    },
    {
      "category": "biology",
      "text": "The spinal cord is part of the central nervous system."
    },
    {
      "category": "biology",
      "text": "Cell membranes control what enters and exits the cell."
    },
    {
      "category": "biology",
      "text": "The kidney filters waste from the blood to form urine."
    },
    {
      "category": "biology",
      "text": "ATP (adenosine triphosphate) is the energy currency of the cell."
    },
    {
      "category": "biology",
      "text": "The ribosome is the site of protein synthesis."
    },
    {
      "category": "biology",
      "text": "The human genome project was completed in 2003."
    },
    {
      "category": "biology",
      "text": "Birds have hollow bones to help them fly."
    },
    {
      "category": "biology",
      "text": "Viruses can infect all types of life forms, from animals to bacteria."
    },
    {
      "category": "biology",
      "text": "Insects are the most diverse group of animals on Earth."
    },
    {
      "category": "biology",
      "text": "The immune system includes the spleen, lymph nodes, and white blood cells."
    },
    {
      "category": "biology",
      "text": "Algae produce a large portion of the world's oxygen."
    },
    {
      "category": "biology",
      "text": "The endocrine system controls hormones and body functions."
    },
    {
      "category": "biology",
      "text": "Natural selection favors traits that improve survival and reproduction."
    },
    {
      "category": "biology",
      "text": "Cells divide through processes like mitosis and meiosis."
    },
    {
      "category": "biology",
      "text": "The human stomach produces hydrochloric acid to aid digestion."
    },
    {
      "category": "biology",
      "text": "The appendix is a vestigial organ with limited known function."
    },
    {
      "category": "biology",
      "text": "DNA replication is the process of making a copy of DNA."
    },
    {
      "category": "biology",
      "text": "Microorganisms live in the human gut and aid in digestion."
    },
    {
      "category": "biology",
      "text": "The skin is the body’s largest organ."
    },
    {
      "category": "biology",
      "text": "Different blood types are determined by the presence or absence of antigens."
    },
    {
      "category": "biology",
      "text": "The spleen helps filter blood and fight infections."
    },
    {
      "category": "biology",
      "text": "Vaccines help the immune system recognize and combat pathogens."
    },
    {
      "category": "biology",
      "text": "Eukaryotic cells have a nucleus, while prokaryotic cells do not."
    },
    {
      "category": "biology",
      "text": "White blood cells defend the body against infectious disease."
    },
    {
      "category": "biology",
      "text": "The human body is host to trillions of microorganisms."
    },
    {
      "category": "biology",
      "text": "A gene mutation can result in a change in a protein’s function."
    },
    {
      "category": "biology",
      "text": "Biodiversity refers to the variety of life in the world."
    },
    {
      "category": "biology",
      "text": "The theory of endosymbiosis explains the origin of mitochondria and chloroplasts."
    },
    {
      "category": "biology",
      "text": "Homeostasis is the maintenance of a stable internal environment."
    },
    {
      "category": "biology",
      "text": "Animals are classified into phyla such as chordates and arthropods."
    },
    {
      "category": "biology",
      "text": "The circulatory system consists of the heart, blood, and blood vessels."
    },
    {
      "category": "biology",
      "text": "The nervous system consists of the brain, spinal cord, and nerves."
    },
    {
      "category": "biology",
      "text": "Genotype refers to the genetic makeup, while phenotype is the observable trait."
    },
    {
      "category": "biology",
      "text": "Some plants can reproduce both sexually and asexually."
    },
    {
      "category": "biology",
      "text": "Antibiotics work against bacteria but not viruses."
    },
    {
      "category": "biology",
      "text": "Each DNA strand is made of four bases: adenine, thymine, cytosine, and guanine."
    },
    {
      "category": "biology",
      "text": "The placenta provides oxygen and nutrients to a developing fetus."
    },
    {
      "category": "biology",
      "text": "All vertebrates have a backbone or spinal column."
    },
    {
      "category": "biology",
      "text": "The pituitary gland is known as the master gland of the endocrine system."
    },
    {
      "category": "biology",
      "text": "A dominant gene will mask the effect of a recessive gene."
    },
    {
      "category": "biology",
      "text": "Meiosis creates gametes for sexual reproduction."
    },
    {
      "category": "biology",
      "text": "Some animals can regenerate entire body parts."
    },
    {
      "category": "biology",
      "text": "Mendel is known as the father of modern genetics."
    },
    {
      "category": "biology",
      "text": "Coral reefs are made up of tiny animals called polyps."
    },
    {
      "category": "biology",
      "text": "Organ systems work together to maintain the body’s function."
    },
    {
      "category": "youtube",
      "text": "YouTube was created by Steve Chen, Chad Hurley, and Jawed Karim in 2005."
    },
    {
      "category": "youtube",
      "text": "The first video uploaded to YouTube was titled 'Me at the zoo'."
    },
    {
      "category": "youtube",
      "text": "Google bought YouTube in 2006 for $1.65 billion in stock."
    },
    {
      "category": "youtube",
      "text": "YouTube is the second most visited website in the world, after Google."
    },
    {
      "category": "youtube",
      "text": "YouTube has over 2.5 billion logged-in monthly users."
    },
    {
      "category": "youtube",
      "text": "Users watch over 1 billion hours of YouTube videos every day."
    },
    {
      "category": "youtube",
      "text": "YouTube is available in over 100 countries and 80 languages."
    },
    {
      "category": "youtube",
      "text": "The most-liked video on YouTube is 'Despacito' by Luis Fonsi ft. Daddy Yankee."
    },
    {
      "category": "youtube",
      "text": "YouTube allows users to earn money through the YouTube Partner Program."
    },
    {
      "category": "youtube",
      "text": "YouTube Shorts allows creators to share vertical short-form videos up to 60 seconds long."
    },
    {
      "category": "youtube",
      "text": "The YouTube algorithm recommends videos based on watch history and engagement."
    },
    {
      "category": "youtube",
      "text": "MrBeast is one of the highest-earning YouTubers."
    },
    {
      "category": "youtube",
      "text": "YouTube Premium offers ad-free videos and background play."
    },
    {
      "category": "youtube",
      "text": "YouTube has a restricted mode to filter out potentially mature content."
    },
    {
      "category": "youtube",
      "text": "Live streaming on YouTube allows real-time interaction with viewers."
    },
    {
      "category": "youtube",
      "text": "YouTube Kids is a separate app with age-appropriate content."
    },
    {
      "category": "youtube",
      "text": "The YouTube trending tab shows popular videos in your region."
    },
    {
      "category": "youtube",
      "text": "Creators can use YouTube Analytics to monitor performance."
    },
    {
      "category": "youtube",
      "text": "YouTube introduced community posts to interact with subscribers through text and images."
    },
    {
      "category": "youtube",
      "text": "YouTube Studio is used to manage videos, analytics, and comments."
    },
    {
      "category": "youtube",
      "text": "YouTube uses Content ID to detect copyrighted material in videos."
    },
    {
      "category": "youtube",
      "text": "Super Chat allows fans to pay to have their messages highlighted in live chats."
    },
    {
      "category": "youtube",
      "text": "YouTube has a dark theme to reduce eye strain."
    },
    {
      "category": "youtube",
      "text": "The 'Like' and 'Dislike' buttons help personalize content recommendations."
    },
    {
      "category": "youtube",
      "text": "YouTube introduced 'handles' for creators to have a unique identity, like @channelname."
    },
    {
      "category": "youtube",
      "text": "YouTube Music is a separate app for streaming music videos and songs."
    },
    {
      "category": "youtube",
      "text": "Creators must have at least 1,000 subscribers and 4,000 watch hours in the past year to monetize."
    },
    {
      "category": "youtube",
      "text": "YouTube's autoplay feature automatically plays the next recommended video."
    },
    {
      "category": "youtube",
      "text": "YouTube allows 4K and even 8K video uploads."
    },
    {
      "category": "youtube",
      "text": "Subtitles and closed captions improve accessibility and SEO."
    },
    {
      "category": "youtube",
      "text": "YouTube's algorithm rewards high watch time and engagement."
    },
    {
      "category": "youtube",
      "text": "Play buttons are awarded to creators reaching subscriber milestones (e.g., Silver for 100k subs)."
    },
    {
      "category": "youtube",
      "text": "Some YouTubers turn their channels into full-time businesses."
    },
    {
      "category": "youtube",
      "text": "YouTube has policies to fight misinformation and harmful content."
    },
    {
      "category": "youtube",
      "text": "YouTube Rewind was an annual video recap until it was discontinued in 2020."
    },
    {
      "category": "youtube",
      "text": "YouTube allows embedding videos on external websites."
    },
    {
      "category": "youtube",
      "text": "There is a YouTube Creator Academy with free courses for aspiring creators."
    },
    {
      "category": "youtube",
      "text": "YouTube supports 360-degree and VR videos."
    },
    {
      "category": "youtube",
      "text": "Videos must comply with YouTube’s community guidelines to avoid being removed."
    },
    {
      "category": "youtube",
      "text": "Channels can be verified to prove authenticity."
    },
    {
      "category": "youtube",
      "text": "YouTube offers a 'Join' button for memberships with exclusive perks."
    },
    {
      "category": "youtube",
      "text": "Creators can schedule videos to go live at a specific time."
    },
    {
      "category": "youtube",
      "text": "YouTube detects and removes fake views and likes."
    },
    {
      "category": "youtube",
      "text": "Many traditional celebrities now have YouTube channels."
    },
    {
      "category": "youtube",
      "text": "The comments section is a key space for audience interaction."
    },
    {
      "category": "youtube",
      "text": "Viewers can report videos that violate community guidelines."
    },
    {
      "category": "youtube",
      "text": "YouTube includes an age restriction feature for mature content."
    },
    {
      "category": "youtube",
      "text": "The YouTube app is available on phones, tablets, TVs, and consoles."
    },
    {
      "category": "youtube",
      "text": "YouTube generates revenue primarily through ads."
    },
    {
      "category": "youtube",
      "text": "YouTube's algorithm considers click-through rate (CTR) for recommendations."
    },
    {
      "category": "youtube",
      "text": "Many viral trends and challenges started on YouTube."
    },
    {
      "category": "youtube",
      "text": "Educational content on YouTube includes tutorials, lectures, and documentaries."
    },
    {
      "category": "youtube",
      "text": "Users can create playlists to organize favorite videos."
    },
    {
      "category": "youtube",
      "text": "YouTube supports multi-language metadata for broader reach."
    },
    {
      "category": "youtube",
      "text": "YouTube offers copyright-free music for creators in its Audio Library."
    },
    {
      "category": "youtube",
      "text": "YouTube removed the public dislike count in 2021 to reduce harassment."
    },
    {
      "category": "youtube",
      "text": "Shorts creation tools allow trimming and remixing from existing videos."
    },
    {
      "category": "youtube",
      "text": "YouTube chapters divide videos into segments for easier navigation."
    },
    {
      "category": "youtube",
      "text": "Channels can have a trailer video that auto-plays for non-subscribers."
    },
    {
      "category": "youtube",
      "text": "YouTube's homepage is customized based on user preferences and history."
    },
    {
      "category": "youtube",
      "text": "Many educational institutions use YouTube for online classes."
    },
    {
      "category": "youtube",
      "text": "YouTube has become a major platform for independent filmmakers."
    },
    {
      "category": "youtube",
      "text": "Brands use YouTube influencers for sponsored promotions."
    },
    {
      "category": "youtube",
      "text": "YouTube restricts monetization for videos with sensitive or inappropriate topics."
    },
    {
      "category": "youtube",
      "text": "Live streams can be DVR-enabled for viewers to rewind during broadcast."
    },
    {
      "category": "youtube",
      "text": "YouTube supports automated and manual review for monetization approval."
    },
    {
      "category": "youtube",
      "text": "Videos that go against community standards may be demonetized or taken down."
    },
    {
      "category": "youtube",
      "text": "The YouTube community tab becomes available after reaching 500 subscribers."
    },
    {
      "category": "youtube",
      "text": "YouTube videos can be looped by right-clicking and selecting 'Loop'."
    },
    {
      "category": "youtube",
      "text": "YouTube allows tagging other channels in video descriptions and titles."
    },
    {
      "category": "youtube",
      "text": "YouTube offers Super Thanks, where viewers can tip creators on any video."
    },
    {
      "category": "youtube",
      "text": "YouTube allows parental control via Family Link and account supervision."
    },
    {
      "category": "youtube",
      "text": "Copyright strikes can lead to channel termination after three violations."
    },
    {
      "category": "youtube",
      "text": "YouTube stories are short vertical videos that expire in 7 days."
    },
    {
      "category": "youtube",
      "text": "YouTube content is used widely for digital marketing strategies."
    },
    {
      "category": "youtube",
      "text": "Creators can monetize through affiliate links and sponsorships in video descriptions."
    },
    {
      "category": "youtube",
      "text": "YouTube's search engine is the second largest after Google."
    },
    {
      "category": "youtube",
      "text": "Video retention is crucial for growing a channel and increasing visibility."
    },
    {
      "category": "youtube",
      "text": "YouTube uses AI to recommend thumbnails and titles for better engagement."
    },
    {
      "category": "youtube",
      "text": "The platform uses machine learning to automatically generate captions."
    },
    {
      "category": "food",
      "text": "Bananas are berries, but strawberries are not."
    },
    {
      "category": "food",
      "text": "Carrots were originally purple, not orange."
    },
    {
      "category": "food",
      "text": "Apples float in water because they are 25% air."
    },
    {
      "category": "food",
      "text": "Tomatoes are fruits, botanically classified as berries."
    },
    {
      "category": "food",
      "text": "Honey is the only food that never spoils."
    },
    {
      "category": "food",
      "text": "Watermelons are 92% water."
    },
    {
      "category": "food",
      "text": "Broccoli contains more protein than steak per calorie."
    },
    {
      "category": "food",
      "text": "Avocados have more potassium than bananas."
    },
    {
      "category": "food",
      "text": "Mangoes are the most consumed fruit in the world."
    },
    {
      "category": "food",
      "text": "Cucumbers are fruits, not vegetables."
    },
    {
      "category": "food",
      "text": "Pineapples regenerate—plant the top to grow a new one."
    },
    {
      "category": "food",
      "text": "Peanuts are legumes, not nuts."
    },
    {
      "category": "food",
      "text": "Potatoes were the first vegetable grown in space."
    },
    {
      "category": "food",
      "text": "Garlic has natural antibiotic properties."
    },
    {
      "category": "food",
      "text": "Chili peppers get their heat from a compound called capsaicin."
    },
    {
      "category": "food",
      "text": "Oysters can change gender multiple times during their lives."
    },
    {
      "category": "food",
      "text": "Milk is the only food that contains every nutrient the human body needs."
    },
    {
      "category": "food",
      "text": "Cranberries bounce when they're ripe."
    },
    {
      "category": "food",
      "text": "Applesauce was the first food eaten in space by an American astronaut."
    },
    {
      "category": "food",
      "text": "Almonds are seeds, not true nuts."
    },
    {
      "category": "food",
      "text": "Coconut water can be used as a blood plasma substitute in emergencies."
    },
    {
      "category": "food",
      "text": "The durian fruit is banned in many public places in Asia due to its strong odor."
    },
    {
      "category": "food",
      "text": "Onions can make you cry because of the sulfuric compounds they release."
    },
    {
      "category": "food",
      "text": "Bell peppers come in a variety of colors with varying sweetness."
    },
    {
      "category": "food",
      "text": "Spinach is high in iron, but not as high as originally believed."
    },
    {
      "category": "food",
      "text": "The world's hottest chili pepper is the Carolina Reaper."
    },
    {
      "category": "food",
      "text": "Pistachios are technically fruits."
    },
    {
      "category": "food",
      "text": "A single cup of cooked kale has more vitamin C than an orange."
    },
    {
      "category": "food",
      "text": "Ripe bananas glow blue under black light."
    },
    {
      "category": "food",
      "text": "The cashew nut grows outside the fruit called a cashew apple."
    },
    {
      "category": "food",
      "text": "Quinoa is a seed but cooked and eaten like a grain."
    },
    {
      "category": "food",
      "text": "Oranges were not originally orange in color."
    },
    {
      "category": "food",
      "text": "Blueberries are one of the only natural foods that are truly blue."
    },
    {
      "category": "food",
      "text": "Beets can turn your urine pink—a harmless condition called beeturia."
    },
    {
      "category": "food",
      "text": "Mushrooms are fungi, not plants."
    },
    {
      "category": "food",
      "text": "Iceberg lettuce has very low nutritional value compared to leafy greens like spinach."
    },
    {
      "category": "food",
      "text": "Soybeans are one of the few plant sources of complete protein."
    },
    {
      "category": "food",
      "text": "Yogurt contains beneficial probiotic bacteria."
    },
    {
      "category": "food",
      "text": "Egg yolks are one of the few foods naturally containing vitamin D."
    },
    {
      "category": "food",
      "text": "Cheese was likely discovered by accident when milk was stored in animal stomachs."
    },
    {
      "category": "food",
      "text": "Chocolate was once used as currency by the Aztecs."
    },
    {
      "category": "food",
      "text": "Olives are fruits, not vegetables."
    },
    {
      "category": "food",
      "text": "Zucchini is technically a fruit, not a vegetable."
    },
    {
      "category": "food",
      "text": "Lemons float, but limes sink."
    },
    {
      "category": "food",
      "text": "Rice is a staple food for more than half of the world's population."
    },
    {
      "category": "food",
      "text": "Grapes explode when you put them in the microwave—don't try it."
    },
    {
      "category": "food",
      "text": "Pineapple contains bromelain, which breaks down protein and can tenderize meat."
    },
    {
      "category": "food",
      "text": "Eggplant is a berry."
    },
    {
      "category": "food",
      "text": "Apples ripen six to ten times faster at room temperature than in the refrigerator."
    },
    {
      "category": "food",
      "text": "The seeds of an avocado are toxic to many animals."
    },
    {
      "category": "food",
      "text": "Some oranges are green even when ripe."
    },
    {
      "category": "food",
      "text": "Pumpkins are fruits, not vegetables."
    },
    {
      "category": "food",
      "text": "Kiwi is originally from China, not New Zealand."
    },
    {
      "category": "food",
      "text": "Peppers and chilies belong to the nightshade family."
    },
    {
      "category": "food",
      "text": "Raspberries are made up of tiny drupelets."
    },
    {
      "category": "food",
      "text": "Figs are pollinated by wasps that die inside the fruit."
    },
    {
      "category": "food",
      "text": "Cabbage and broccoli are from the same plant family: Brassica."
    },
    {
      "category": "food",
      "text": "Sweet potatoes and yams are not the same vegetable."
    },
    {
      "category": "food",
      "text": "Corn is both a vegetable and a grain, and technically a fruit too."
    },
    {
      "category": "food",
      "text": "Cherries contain antioxidants that may help reduce inflammation."
    },
    {
      "category": "food",
      "text": "Parsley is more than a garnish—it’s rich in vitamins A, C, and K."
    },
    {
      "category": "food",
      "text": "Cauliflower comes in multiple colors including purple, orange, and green."
    },
    {
      "category": "food",
      "text": "Peas are one of the oldest cultivated crops."
    },
    {
      "category": "food",
      "text": "Rhubarb leaves are toxic due to high levels of oxalic acid."
    },
    {
      "category": "food",
      "text": "Basil is a member of the mint family."
    },
    {
      "category": "food",
      "text": "Strawberries have their seeds on the outside."
    },
    {
      "category": "food",
      "text": "Artichokes are actually flower buds."
    },
    {
      "category": "food",
      "text": "Lettuce was first cultivated by the ancient Egyptians."
    },
    {
      "category": "food",
      "text": "Some food dyes are made from crushed insects."
    },
    {
      "category": "food",
      "text": "Cinnamon is made from the inner bark of trees."
    },
    {
      "category": "food",
      "text": "Vanilla is derived from the orchid plant."
    },
    {
      "category": "food",
      "text": "The world's most expensive spice by weight is saffron."
    },
    {
      "category": "food",
      "text": "Gelatin is made from collagen found in animal bones and skin."
    },
    {
      "category": "food",
      "text": "Sugarcane is the world’s largest crop by production quantity."
    },
    {
      "category": "food",
      "text": "Radishes were once used as currency in ancient Egypt."
    },
    {
      "category": "food",
      "text": "The green part of potatoes contains solanine, which is toxic."
    },
    {
      "category": "food",
      "text": "Seaweed is edible and highly nutritious."
    },
    {
      "category": "food",
      "text": "Eggs can float in water if they’re old, due to air buildup inside."
    },
    {
      "category": "food",
      "text": "Garbanzo beans are also known as chickpeas."
    },
    {
      "category": "food",
      "text": "Maple syrup is made from the sap of maple trees."
    },
    
      { "category": "child's psychology", "text": "Children develop 90% of their brain by the age of 5." },
      { "category": "child's psychology", "text": "Positive reinforcement encourages good behavior in children." },
      { "category": "child's psychology", "text": "Children mimic adult behavior to learn social norms." },
      { "category": "child's psychology", "text": "Consistency helps children feel safe and secure." },
      { "category": "child's psychology", "text": "Play is essential for emotional and cognitive development." },
      { "category": "child's psychology", "text": "Secure attachment leads to better emotional regulation." },
      { "category": "child's psychology", "text": "Children learn language fastest between ages 2 and 7." },
      { "category": "child's psychology", "text": "Self-esteem begins to form in early childhood." },
      { "category": "child's psychology", "text": "Parental involvement is linked to academic success." },
      { "category": "child's psychology", "text": "Children need routines to build a sense of order." },
      { "category": "child's psychology", "text": "Early childhood experiences shape adult personality." },
      { "category": "child's psychology", "text": "Empathy starts to develop around age 2." },
      { "category": "child's psychology", "text": "Children understand basic emotions by age 3." },
      { "category": "child's psychology", "text": "Unstructured play enhances creativity." },
      { "category": "child's psychology", "text": "Children need validation of their feelings." },
      { "category": "child's psychology", "text": "Discipline should focus on teaching, not punishment." },
      { "category": "child's psychology", "text": "Modeling calm behavior helps children manage anger." },
      { "category": "child's psychology", "text": "Children have different learning styles." },
      { "category": "child's psychology", "text": "Emotional intelligence is as important as IQ." },
      { "category": "child's psychology", "text": "Praise effort, not outcome, to encourage growth mindset." },
      { "category": "child's psychology", "text": "A childs temperament is influenced by genetics and environment." },
      { "category": "child's psychology", "text": "Reading to children improves language development." },
      { "category": "child's psychology", "text": "Active listening builds trust and respect." },
      { "category": "child's psychology", "text": "Transitions can be difficult for children." },
      { "category": "child's psychology", "text": "Children often express anxiety through behavior." },
      { "category": "child's psychology", "text": "Sleep is critical for mental and physical growth." },
      { "category": "child's psychology", "text": "Children need opportunities to make choices." },
      { "category": "child's psychology", "text": "Exposure to nature reduces stress in children." },
      { "category": "child's psychology", "text": "Children may regress during periods of stress." },
      { "category": "child's psychology", "text": "Healthy attachment promotes confidence and independence." },
      { "category": "child's psychology", "text": "Imaginative play helps develop empathy and problem-solving." },
      { "category": "child's psychology", "text": "Screen time should be age-appropriate and limited." },
      { "category": "child's psychology", "text": "Children thrive on positive attention." },
      { "category": "child's psychology", "text": "Peer relationships become more important in middle childhood." },
      { "category": "child's psychology", "text": "Children need help identifying and naming emotions." },
      { "category": "child's psychology", "text": "Routines help children feel in control." },
      { "category": "child's psychology", "text": "Tantrums are normal in toddlers due to limited communication skills." },
      { "category": "child's psychology", "text": "Supportive parenting reduces behavioral problems." },
      { "category": "child's psychology", "text": "Children are sensitive to parental conflict." },
      { "category": "child's psychology", "text": "Music and movement support brain development." },
      { "category": "child's psychology", "text": "Secure relationships with adults support emotional growth." },
      { "category": "child's psychology", "text": "Early intervention improves outcomes for developmental delays." },
      { "category": "child's psychology", "text": "Children learn through repetition." },
      { "category": "child's psychology", "text": "Attachment styles form in infancy." },
      { "category": "child's psychology", "text": "Consistent caregiving builds trust." },
      { "category": "child's psychology", "text": "Expressive arts can support emotional healing." },
      { "category": "child's psychology", "text": "Childrens play often reflects their inner world." },
      { "category": "child's psychology", "text": "Physical activity improves mood and behavior." },
      { "category": "child's psychology", "text": "Encouraging curiosity promotes lifelong learning." },
      { "category": "child's psychology", "text": "Trauma in childhood can have long-term effects." },
      { "category": "child's psychology", "text": "Social skills are learned through practice." },
      { "category": "child's psychology", "text": "Over-scheduling can lead to stress in children." },
      { "category": "child's psychology", "text": "Young children are egocentric and gradually learn perspective-taking." },
      { "category": "child's psychology", "text": "Parental warmth is linked to emotional well-being." },
      { "category": "child's psychology", "text": "Negative labels can affect self-identity." },
      { "category": "child's psychology", "text": "Children benefit from age-appropriate responsibilities." },
      { "category": "child's psychology", "text": "Children may struggle with abstract concepts." },
      { "category": "child's psychology", "text": "Non-verbal cues are important in communication with children." },
      { "category": "child's psychology", "text": "Parental expectations influence children's self-image." },
      { "category": "child's psychology", "text": "Children often learn more from what you do than what you say." },
      { "category": "child's psychology", "text": "Building resilience helps children cope with adversity." },
      { "category": "child's psychology", "text": "Children learn empathy by being treated with empathy." },
      { "category": "child's psychology", "text": "Establishing boundaries fosters respect and safety." },
      { "category": "child's psychology", "text": "Children may not have the vocabulary to express complex emotions." },
      { "category": "child's psychology", "text": "Consistency in rules helps reduce confusion and misbehavior." },
      { "category": "child's psychology", "text": "Supportive teachers can greatly influence child development." },
      { "category": "child's psychology", "text": "Children develop a sense of self by age 2." },
      { "category": "child's psychology", "text": "A growth mindset helps children overcome challenges." },
      { "category": "child's psychology", "text": "Stress in parents can affect childrens behavior." },
      { "category": "child's psychology", "text": "Cultural background influences parenting styles and development." },
      { "category": "child's psychology", "text": "Encouraging independence builds confidence." },
      { "category": "child's psychology", "text": "Parental involvement in education improves outcomes." },
      { "category": "child's psychology", "text": "Siblings play a role in social and emotional learning." },
      { "category": "child's psychology", "text": "Early positive relationships lay the groundwork for future success." },
      { "category": "child's psychology", "text": "Children can develop anxiety from academic pressure." },
      { "category": "child's psychology", "text": "Understanding child development stages aids better parenting." },
      { "category": "child's psychology", "text": "Storytelling enhances memory and comprehension." },
      { "category": "child's psychology", "text": "Children's questions are key learning opportunities." },
      { "category": "child's psychology", "text": "Restorative discipline teaches responsibility." },
      { "category": "child's psychology", "text": "Children benefit from feeling heard and understood." },
      { "category": "child's psychology", "text": "Open communication fosters emotional security." },
      { "category": "child's psychology", "text": "Recognizing triggers helps prevent meltdowns." },
      { "category": "child's psychology", "text": "Children often show emotions through behavior before words." },
      { "category": "child's psychology", "text": "Teaching mindfulness can reduce anxiety in children." },
    
  
      
        {"category": "women", "text": "Women generally have a stronger immune response than men."},
        {"category": "women", "text": "Marie Curie was the first woman to win a Nobel Prize and the only person to win in two different sciences."},
        {"category": "women", "text": "Women have a higher percentage of body fat than men naturally."},
        {"category": "women", "text": "Globally, women live longer than men on average."},
        {"category": "women", "text": "The first computer programmer was a womanAda Lovelace."},
        {"category": "women", "text": "Women tend to have better verbal memory than men."},
        {"category": "women", "text": "In many species, including humans, females are more selective in choosing mates."},
        {"category": "women", "text": "The brains of women are more connected between the hemispheres compared to men."},
        {"category": "women", "text": "Globally, women are more likely than men to pursue higher education."},
        {"category": "women", "text": "Women blink nearly twice as much as men."},
        {"category": "women", "text": "The suffragette movement led to women gaining the right to vote in many countries in the early 20th century."},
        {"category": "women", "text": "Estrogen contributes to better fat metabolism in women."},
        {"category": "women", "text": "Malala Yousafzai is the youngest Nobel Prize laureate and an advocate for girls education."},
        {"category": "women", "text": "Women are less likely to be diagnosed with heart disease at a young age compared to men."},
        {"category": "women", "text": "Women have been shown to excel in multitasking under some studies."},
        {"category": "women", "text": "The majority of healthcare workers around the world are women."},
        {"category": "women", "text": "Women are more likely than men to experience depression and anxiety."},
        {"category": "women", "text": "Breast cancer is the most common cancer among women worldwide."},
        {"category": "women", "text": "Womens pain is often underestimated or misdiagnosed in medical settings."},
        {"category": "women", "text": "In 2020, women made up 47.7% of the global labor force."},
        {"category": "women", "text": "The average age for menopause in women is 51."},
        {"category": "women", "text": "Women were first allowed to participate in the Olympics in 1900."},
        {"category": "women", "text": "The hormone oxytocin, which promotes bonding, is higher in women, especially after childbirth."},
        {"category": "women", "text": "Women are more prone to autoimmune diseases than men."},
        {"category": "women", "text": "Women tend to have a keener sense of smell than men."},
        {"category": "women", "text": "Historically, many cultures considered women unfit for leadership, but this has drastically changed."},
        {"category": "women", "text": "In politics, countries like Finland and New Zealand have had women prime ministers and presidents."},
        {"category": "women", "text": "The female pelvis is wider to support childbirth."},
        {"category": "women", "text": "On average, women have a higher pain threshold than men."},
        {"category": "women", "text": "Globally, the literacy rate among women has steadily increased over the past 50 years."},
        {"category": "women", "text": "International Women's Day is celebrated on March 8 every year."},
        {"category": "women", "text": "Women were not allowed to run marathons until the late 20th century."},
        {"category": "women", "text": "Serena Williams is considered one of the greatest athletes of all time."},
        {"category": "women", "text": "Women have played pivotal roles in revolutions, civil rights movements, and social change."},
        {"category": "women", "text": "Women metabolize alcohol differently due to enzyme differences."},
        {"category": "women", "text": "Female artists like Frida Kahlo and Georgia OKeeffe revolutionized the art world."},
        {"category": "women", "text": "Women are more likely than men to be caregivers in families."},
        {"category": "women", "text": "The first woman in space was Valentina Tereshkova in 1963."},
        {"category": "women", "text": "The maternal mortality rate is still high in some developing countries."},
        {"category": "women", "text": "Many major religions have had influential women leaders and saints."},
        {"category": "women", "text": "Women-led companies often outperform those led by men, according to some studies."},
        {"category": "women", "text": "Women were historically excluded from formal education in many societies."},
        {"category": "women", "text": "Globally, more girls are now attending school than ever before."},
        {"category": "women", "text": "In most countries, women vote at equal or higher rates than men."},
        {"category": "women", "text": "Women often face a wage gap compared to their male counterparts."},
        {"category": "women", "text": "The female reproductive system is one of the most complex in biology."},
        {"category": "women", "text": "Many women entrepreneurs are changing the landscape of global business."},
        {"category": "women", "text": "Women in ancient Sparta had more rights than in many modern societies."},
        {"category": "women", "text": "Postpartum depression affects 1 in 7 women after childbirth."},
        {"category": "women", "text": "Womens participation in sports has increased significantly in the past few decades."},
        {"category": "women", "text": "The XX chromosome configuration determines female biological sex."},
        {"category": "women", "text": "Women tend to have better fine motor coordination."},
        {"category": "women", "text": "Rosa Parks' refusal to give up her seat sparked the U.S. Civil Rights Movement."},
        {"category": "women", "text": "The first female Nobel Peace Prize winner was Bertha von Suttner."},
        {"category": "women", "text": "Womens intuition is often linked to stronger emotional processing centers in the brain."},
        {"category": "women", "text": "Globally, women face higher risks of gender-based violence."},
        {"category": "women", "text": "Women are often the backbone of community and social development."},
        {"category": "women", "text": "Women generally outperform men in academic achievement globally."},
        {"category": "women", "text": "Women are more likely to be single parents than men."},
        {"category": "women", "text": "Many indigenous cultures honored women as leaders and healers."},
        {"category": "women", "text": "Women are more likely to seek mental health support than men."},
        {"category": "women", "text": "Women historically used midwives and herbal medicine for health care."},
        {"category": "women", "text": "Globally, more women than men are enrolled in tertiary education."},
        {"category": "women", "text": "Female literacy has a direct impact on community health and child survival."},
        {"category": "women", "text": "Women were once barred from owning property or voting in many countries."},
        {"category": "women", "text": "Women often play a larger role in family financial planning."},
        {"category": "women", "text": "The number of female CEOs in Fortune 500 companies is increasing."},
        {"category": "women", "text": "Women are underrepresented in STEM fields but numbers are growing."},
        {"category": "women", "text": "Womens hearts beat faster than mens on average."},
        {"category": "women", "text": "Many female authors have used male pen names to be published."},
        {"category": "women", "text": "Women are often more empathetic, according to psychological studies."},
        {"category": "women", "text": "Periods can affect mood, energy, and cognition due to hormonal changes."},
        {"category": "women", "text": "Some cultures celebrate a girl's first period as a rite of passage."},
        {"category": "women", "text": "Women in leadership roles often score higher in emotional intelligence."},
        {"category": "women", "text": "Studies show female-led countries handled the COVID-19 pandemic more effectively."},
        {"category": "women", "text": "Women are more prone to osteoporosis than men."},
        {"category": "women", "text": "Hormonal cycles affect womens sleep patterns."},
        {"category": "women", "text": "Women in ancient Egypt had legal rights and could own land."},
        {"category": "women", "text": "Women make 80% of healthcare decisions for their families."},
        {"category": "women", "text": "Female animals in many species lead groups, such as elephants."},
        {"category": "women", "text": "Menopause is a natural stage in a woman's life, not a disease."},
        {"category": "women", "text": "Women have smaller lungs than men, affecting respiration and athletic endurance."},
        {"category": "women", "text": "Women are more likely to volunteer and be involved in community service."},
        {"category": "women", "text": "Women experience heart attack symptoms differently than men."},


        
          {"category": "japan", "text": "Japan is an island nation in East Asia consisting of over 6,800 islands."},
          {"category": "japan", "text": "Tokyo, the capital of Japan, is one of the largest metropolitan areas in the world."},
          {"category": "japan", "text": "Mount Fuji is Japan's highest peak and an iconic cultural symbol."},
          {"category": "japan", "text": "The Japanese writing system uses three scripts: Kanji, Hiragana, and Katakana."},
          {"category": "japan", "text": "Japan has one of the highest life expectancies in the world."},
          {"category": "japan", "text": "The traditional Japanese tea ceremony is called 'Chanoyu'."},
          {"category": "japan", "text": "Cherry blossoms, or 'Sakura,' are a national symbol of Japan."},
          {"category": "japan", "text": "Samurai were the warrior class in feudal Japan, known for their code of honor, Bushido."},
          {"category": "japan", "text": "The bullet train, or 'Shinkansen,' is famous for its speed and punctuality."},
          {"category": "japan", "text": "Japan was the first Asian country to industrialize during the Meiji Restoration in the late 19th century."},
          {"category": "japan", "text": "Origami is the traditional Japanese art of paper folding."},
          {"category": "japan", "text": "Japan has a constitutional monarchy with the Emperor as the ceremonial head of state."},
          {"category": "japan", "text": "The Japanese economy is the third largest in the world by nominal GDP."},
          {"category": "japan", "text": "Ikebana is the Japanese art of flower arranging."},
          {"category": "japan", "text": "The Japanese archipelago experiences frequent earthquakes due to its location on the Pacific Ring of Fire."},
          {"category": "japan", "text": "Anime and manga are hugely popular cultural exports from Japan."},
          {"category": "japan", "text": "Sumo wrestling is Japan's national sport with centuries-old traditions."},
          {"category": "japan", "text": "The Japanese cuisine includes sushi, tempura, ramen, and many other dishes famous worldwide."},
          {"category": "japan", "text": "The concept of 'Wabi-sabi' in Japan celebrates imperfection and impermanence."},
          {"category": "japan", "text": "Japan has one of the world's lowest crime rates."},
          {"category": "japan", "text": "The city of Kyoto is famous for its temples, gardens, and traditional culture."},
          {"category": "japan", "text": "The Shinto religion is native to Japan and emphasizes harmony with nature."},
          {"category": "japan", "text": "Japanese bullet trains can reach speeds of over 300 km/h (186 mph)."},
          {"category": "japan", "text": "Japan's population is aging rapidly, with a high proportion of elderly citizens."},
          {"category": "japan", "text": "The 2011 Tohoku earthquake and tsunami caused widespread devastation and led to the Fukushima nuclear disaster."},
          {"category": "japan", "text": "Manga artists, called mangaka, often work under intense deadlines."},
          {"category": "japan", "text": "Japan has many UNESCO World Heritage Sites, including ancient temples and natural landscapes."},
          {"category": "japan", "text": "Japanese gardens are designed to create peaceful and contemplative spaces."},
          {"category": "japan", "text": "The traditional garment kimono is worn for special occasions."},
          {"category": "japan", "text": "Japan's technological innovations include robotics, electronics, and automotive industries."},
          {"category": "japan", "text": "The Japanese concept of 'Omotenashi' means wholehearted hospitality."},
          {"category": "japan", "text": "Japan has a highly efficient public transportation system, including extensive train networks."},
          {"category": "japan", "text": "The tea plant, Camellia sinensis, was first cultivated in Japan for tea production."},
          {"category": "japan", "text": "The Japanese writing system Kanji was adapted from Chinese characters."},
          {"category": "japan", "text": "Japanese festivals, such as Gion Matsuri and Tanabata, attract millions annually."},
          {"category": "japan", "text": "Haiku is a traditional Japanese form of poetry consisting of three lines."},
          {"category": "japan", "text": "The Japanese archipelago stretches over 3,000 kilometers from north to south."},
          {"category": "japan", "text": "Japan is known for its punctual and efficient delivery services."},
          {"category": "japan", "text": "Japanese gardens often incorporate water features, rocks, and carefully pruned plants."},
          {"category": "japan", "text": "The samurai sword, or katana, is a symbol of the warrior's spirit."},
          {"category": "japan", "text": "Japan has the world's oldest monarchy, dating back over 2,600 years."},
          {"category": "japan", "text": "The Japanese have a unique style of calligraphy known as Shodo."},
          {"category": "japan", "text": "Bonsai is the art of growing miniature trees in containers."},
          {"category": "japan", "text": "Japans national flag is called 'Nisshoki' or 'Hinomaru' and features a red circle symbolizing the sun."},
          {"category": "japan", "text": "Japanese cuisine often emphasizes seasonality and presentation."},
          {"category": "japan", "text": "The island of Okinawa is known for the longevity of its residents."},
          {"category": "japan", "text": "Japan was the only Asian country never colonized by a Western power."},
          {"category": "japan", "text": "The art of woodblock printing, Ukiyo-e, flourished in Japan during the Edo period."},
          {"category": "japan", "text": "Japan's postal system is considered one of the most reliable in the world."},
          {"category": "japan", "text": "Shinkansen trains began operation in 1964, revolutionizing rail travel."},
          {"category": "japan", "text": "Japan has four distinct seasons with unique cultural celebrations for each."},
          {"category": "japan", "text": "The Japanese education system is highly competitive and rigorous."},
          {"category": "japan", "text": "Geisha are traditional female entertainers skilled in music, dance, and conversation."},
          {"category": "japan", "text": "Japan has one of the world's highest literacy rates."},
          {"category": "japan", "text": "The Japanese yen is one of the most traded currencies globally."},
          {"category": "japan", "text": "Japan is a global leader in video game development and technology."},
          {"category": "japan", "text": "Many Japanese companies emphasize lifetime employment and seniority."},
          {"category": "japan", "text": "The Japanese language has polite and humble forms reflecting social hierarchy."},
          {"category": "japan", "text": "Japans national sport, Sumo wrestling, dates back over 1,500 years."},
          {"category": "japan", "text": "Japanese toilets often feature advanced technology like heated seats and bidets."},
          {"category": "japan", "text": "Mount Aso in Japan is one of the world's largest active volcanoes."},
          {"category": "japan", "text": "Japan has a large number of vending machines selling a variety of products."},
          {"category": "japan", "text": "The country's highest mountain, Mount Fuji, is a dormant volcano."},
          {"category": "japan", "text": "Japan's traditional puppet theater is known as Bunraku."},
          {"category": "japan", "text": "Karaoke, meaning 'empty orchestra,' originated in Japan in the 1970s."},
          {"category": "japan", "text": "Japan's GDP per capita ranks among the highest in the world."},
          {"category": "japan", "text": "The Japanese tea ceremony emphasizes mindfulness and aesthetics."},
          {"category": "japan", "text": "Japan has one of the world's most advanced robotics industries."},
          {"category": "japan", "text": "The country has over 200 volcanoes, 60 of which are active."},
          {"category": "japan", "text": "The Japanese film industry produced renowned directors like Akira Kurosawa."},
          {"category": "japan", "text": "Many traditional Japanese houses are made with sliding doors called shoji."},
          {"category": "japan", "text": "Japan has an extensive network of hot springs called onsen."},
          {"category": "japan", "text": "The Meiji era was a time of rapid modernization and westernization in Japan."},
          {"category": "japan", "text": "Japans population is about 125 million people."},
          {"category": "japan", "text": "The country has strict building codes to withstand earthquakes."},
          {"category": "japan", "text": "The Japanese practice 'forest bathing,' or Shinrin-yoku, for relaxation."},
          

          
            {"category": "movies and entertainment", "text": "The first feature-length movie ever made was 'The Story of the Kelly Gang' in 1906."},
            {"category": "movies and entertainment", "text": "Walt Disney holds the record for the most Academy Awards won by an individual."},
            {"category": "movies and entertainment", "text": "The Hollywood Walk of Fame has over 2,600 stars embedded in the sidewalks."},
            {"category": "movies and entertainment", "text": "Titanic was the first film to reach the billion-dollar mark at the box office."},
            {"category": "movies and entertainment", "text": "The movie 'Avatar' (2009) was the highest-grossing film worldwide until 'Avengers: Endgame'."},
            {"category": "movies and entertainment", "text": "Charlie Chaplins iconic character 'The Tramp' first appeared in 1914."},
            {"category": "movies and entertainment", "text": "The Oscars were first held in 1929."},
            {"category": "movies and entertainment", "text": "The longest movie ever made is 'Logistics,' lasting 857 hours (35 days and 17 hours)."},
            {"category": "movies and entertainment", "text": "In the original 'Star Wars' trilogy, Yoda was a puppet controlled by Frank Oz."},
            {"category": "movies and entertainment", "text": "The first sound film was 'The Jazz Singer' released in 1927."},
            {"category": "movies and entertainment", "text": "The first 3D movie was released in 1922, called 'The Power of Love'."},
            {"category": "movies and entertainment", "text": "The Marvel Cinematic Universe (MCU) is the highest-grossing film franchise in history."},
            {"category": "movies and entertainment", "text": "The iconic James Bond character has been played by over seven actors."},
            {"category": "movies and entertainment", "text": "The first movie ever shot entirely on a smartphone was 'Tangerine' in 2015."},
            {"category": "movies and entertainment", "text": "The movie 'Psycho' (1960) was the first American film to show a toilet flushing."},
            {"category": "movies and entertainment", "text": "The movie Gone with the Wind was the first color film to win Best Picture."},
            {"category": "movies and entertainment", "text": "Pixars 'Toy Story' was the first fully computer-animated feature film."},
            {"category": "movies and entertainment", "text": "Alfred Hitchcock never won an Oscar for Best Director despite multiple nominations."},
            {"category": "movies and entertainment", "text": "The Hollywood sign originally read 'Hollywoodland'."},
            {"category": "movies and entertainment", "text": "The Wizard of Oz was one of the first films to use Technicolor."},
            {"category": "movies and entertainment", "text": "Morgan Freeman was often cast as God in several films due to his voice."},
            {"category": "movies and entertainment", "text": "The movie Inception took 10 years to develop before its release in 2010."},
            {"category": "movies and entertainment", "text": "The Lord of the Rings trilogy was filmed entirely in New Zealand."},
            {"category": "movies and entertainment", "text": "Disneyland opened in 1955 and was the first-ever theme park of its kind."},
            {"category": "movies and entertainment", "text": "The first video game to be adapted into a movie was 'Super Mario Bros.' in 1993."},
            {"category": "movies and entertainment", "text": "Meryl Streep holds the record for most Oscar nominations by an actor."},
            {"category": "movies and entertainment", "text": "The Fast and Furious franchise is known for its elaborate car stunts."},
            {"category": "movies and entertainment", "text": "The Matrix trilogy popularized the bullet time visual effect."},
            {"category": "movies and entertainment", "text": "The first Academy Awards ceremony lasted only 15 minutes."},
            {"category": "movies and entertainment", "text": "Stan Lee made cameo appearances in nearly all Marvel films."},
            {"category": "movies and entertainment", "text": "Frozen was the highest-grossing animated film of all time until surpassed by The Lion King remake."},
            {"category": "movies and entertainment", "text": "Charlie Chaplin was one of the founding members of United Artists."},
            {"category": "movies and entertainment", "text": "The famous Hollywood sign was erected in 1923."},
            {"category": "movies and entertainment", "text": "The movie The Godfather is often cited as one of the greatest films ever made."},
            {"category": "movies and entertainment", "text": "The Harry Potter film series is one of the highest-grossing franchises worldwide."},
            {"category": "movies and entertainment", "text": "Many actors use method acting to fully immerse themselves in roles."},
            {"category": "movies and entertainment", "text": "The first movie trailer was released in 1913."},
            {"category": "movies and entertainment", "text": "Gone with the Wind won 10 Academy Awards, the most for a single film until Ben-Hur."},
            {"category": "movies and entertainment", "text": "Avatar was the first film to gross over $2 billion worldwide."},
            {"category": "movies and entertainment", "text": "The Cannes Film Festival is one of the most prestigious film festivals."},
            {"category": "movies and entertainment", "text": "Star Wars was originally titled The Star Wars."},
            {"category": "movies and entertainment", "text": "The first animated feature film was Disney's 'Snow White and the Seven Dwarfs'."},
            {"category": "movies and entertainment", "text": "The Shawshank Redemption was initially a box office failure but gained cult status later."},
            {"category": "movies and entertainment", "text": "Samuel L. Jackson holds the record for the most movies with a PG-13 rating."},
            {"category": "movies and entertainment", "text": "The character of Indiana Jones was inspired by real archaeologists."},
            {"category": "movies and entertainment", "text": "The Pirates of the Caribbean ride at Disneyland inspired the film series."},
            {"category": "movies and entertainment", "text": "The first feature-length animated movie in 3D was 'Chicken Little' (2005)."},
            {"category": "movies and entertainment", "text": "James Cameron directed both Titanic and Avatar."},
            {"category": "movies and entertainment", "text": "The phrase 'May the Force be with you' became iconic after Star Wars."},
            {"category": "movies and entertainment", "text": "The first movie to use computer-generated imagery (CGI) was Westworld (1973)."},
            {"category": "movies and entertainment", "text": "The Batman character has been portrayed by many actors including Michael Keaton and Christian Bale."},
            {"category": "movies and entertainment", "text": "The Oscars statuette is officially called the Academy Award of Merit."},
            {"category": "movies and entertainment", "text": "The longest running Broadway show is The Phantom of the Opera."},
            {"category": "movies and entertainment", "text": "The movie Jaws is credited with inventing the concept of the summer blockbuster."},
            {"category": "movies and entertainment", "text": "Steven Spielberg directed classics like E.T. and Jurassic Park."},
            {"category": "movies and entertainment", "text": "The Simpsons is the longest-running American sitcom."},
            {"category": "movies and entertainment", "text": "The first IMAX movie was Tiger Child in 1970."},
            {"category": "movies and entertainment", "text": "Forrest Gump popularized the phrase Life is like a box of chocolates."},
            {"category": "movies and entertainment", "text": "The Lord of the Rings trilogy won 17 Academy Awards in total."},
            {"category": "movies and entertainment", "text": "The Spider-Man character has been rebooted multiple times in films."},
            {"category": "movies and entertainment", "text": "The Game of Thrones TV series is based on George R.R. Martins novels."},
            {"category": "movies and entertainment", "text": "Walt Disneys first synchronized sound cartoon was Steamboat Willie."},
            {"category": "movies and entertainment", "text": "The Jurassic Park franchise popularized realistic dinosaur CGI."},
            {"category": "movies and entertainment", "text": "The Avengers film brought together multiple superheroes in one movie."},
            {"category": "movies and entertainment", "text": "La La Land tied the record for most Oscar nominations with 14."},
            {"category": "movies and entertainment", "text": "The Lion King was the highest-grossing traditionally animated film."},
            {"category": "movies and entertainment", "text": "The character of Sherlock Holmes has been portrayed by many actors in film and TV."},
            {"category": "movies and entertainment", "text": "The first motion picture camera was invented by Thomas Edison."},
            {"category": "movies and entertainment", "text": "The Matrix was directed by the Wachowskis."},
            {"category": "movies and entertainment", "text": "The Harry Potter books were written by J.K. Rowling."},
            {"category": "movies and entertainment", "text": "Frozen featured the popular song Let It Go."},
            {"category": "movies and entertainment", "text": "The Toy Story franchise revolutionized computer animation."},
            {"category": "movies and entertainment", "text": "The Star Trek franchise has influenced modern technology development."},
            {"category": "movies and entertainment", "text": "The Black Panther movie was a cultural milestone for representation in Hollywood."},


            
              {"category": "technology", "text": "The first computer mouse was made of wood."},
              {"category": "technology", "text": "The first email was sent by Ray Tomlinson in 1971."},
              {"category": "technology", "text": "The word 'robot' comes from the Czech word 'robota' meaning forced labor."},
              {"category": "technology", "text": "More people in the world own a mobile phone than a toothbrush."},
              {"category": "technology", "text": "The first website went live in 1991 and is still online."},
              {"category": "technology", "text": "There are over 1.8 billion websites on the internet."},
              {"category": "technology", "text": "Google processes over 8.5 billion searches per day."},
              {"category": "technology", "text": "The first hard disk drive could hold only 5MB of data."},
              {"category": "technology", "text": "Apple was founded in 1976 by Steve Jobs, Steve Wozniak, and Ronald Wayne."},
              {"category": "technology", "text": "Bluetooth technology was named after a 10th-century Danish king."},
              {"category": "technology", "text": "The first iPhone was released in 2007."},
              {"category": "technology", "text": "Elon Musk founded SpaceX in 2002."},
              {"category": "technology", "text": "Artificial Intelligence (AI) can now generate realistic human faces."},
              {"category": "technology", "text": "The programming language Python was named after 'Monty Pythons Flying Circus'."},
              {"category": "technology", "text": "The average person unlocks their phone over 100 times a day."},
              {"category": "technology", "text": "Wi-Fi doesn't stand for anything  its just a brand name."},
              {"category": "technology", "text": "The world's first 1GB hard drive weighed over 500 pounds."},
              {"category": "technology", "text": "Quantum computers use qubits instead of bits."},
              {"category": "technology", "text": "Spam emails make up nearly half of all email traffic."},
              {"category": "technology", "text": "The Firefox logo is not a fox  its a red panda."},
              {"category": "technology", "text": "NASAs internet speed can reach up to 91 gigabits per second."},
              {"category": "technology", "text": "Microsoft was founded on April 4, 1975."},
              {"category": "technology", "text": "The first Android phone was the HTC Dream, released in 2008."},
              {"category": "technology", "text": "Amazon was originally launched as an online bookstore."},
              {"category": "technology", "text": "USB stands for Universal Serial Bus."},
              {"category": "technology", "text": "The Google Chrome browser was first released in 2008."},
              {"category": "technology", "text": "Facebook was originally called 'TheFacebook'."},
              {"category": "technology", "text": "The first 1TB hard drive was released in 2007."},
              {"category": "technology", "text": "Digital cameras do not require film to capture images."},
              {"category": "technology", "text": "Touchscreens respond to the electrical charge from your fingers."},
              {"category": "technology", "text": "A single Google search uses about 0.3 Wh of energy."},
              {"category": "technology", "text": "Cloud computing allows access to data from anywhere."},
              {"category": "technology", "text": "Drones can be used for delivery, photography, and agriculture."},
              {"category": "technology", "text": "The first video ever uploaded to YouTube was 'Me at the zoo' in 2005."},
              {"category": "technology", "text": "Modern smartphones have more computing power than the Apollo 11 spacecraft."},
              {"category": "technology", "text": "Blockchain technology underpins cryptocurrencies like Bitcoin."},
              {"category": "technology", "text": "Virtual Reality creates immersive digital environments."},
              {"category": "technology", "text": "Moores Law predicted that computing power doubles every two years."},
              {"category": "technology", "text": "5G offers significantly faster mobile internet speeds than 4G."},
              {"category": "technology", "text": "The term 'bug' in computing came from a real moth stuck in a computer."},
              {"category": "technology", "text": "CAPTCHA helps websites distinguish humans from bots."},
              {"category": "technology", "text": "HTML is the standard language for creating web pages."},
              {"category": "technology", "text": "JavaScript is a core technology of the World Wide Web."},
              {"category": "technology", "text": "GitHub is a platform for version control and collaboration."},
              {"category": "technology", "text": "The world's first computer programmer was Ada Lovelace."},
              {"category": "technology", "text": "Tech companies often host hackathons to promote innovation."},
              {"category": "technology", "text": "Augmented Reality (AR) adds digital elements to the real world."},
              {"category": "technology", "text": "The first domain ever registered was symbolics.com in 1985."},
              {"category": "technology", "text": "Emoji were first invented in Japan in the 1990s."},
              {"category": "technology", "text": "Over 90% of the worlds data was generated in the last two years."},
              {"category": "technology", "text": "TikTok is one of the fastest-growing social media platforms."},
              {"category": "technology", "text": "The average website page size has increased drastically in the last decade."},
              {"category": "technology", "text": "GPS was originally developed for military use."},
              {"category": "technology", "text": "Tesla cars receive software updates over the internet."},
              {"category": "technology", "text": "The emoji dictionary is updated regularly by the Unicode Consortium."},
              {"category": "technology", "text": "Supercomputers can solve complex scientific problems quickly."},
              {"category": "technology", "text": "A CAPTCHA can be solved using AI now."},
              {"category": "technology", "text": "Tech giants often use open-source software in their infrastructure."},
              {"category": "technology", "text": "AI-generated images can now be indistinguishable from real ones."},
              {"category": "technology", "text": "Data centers consume significant amounts of electricity."},
              {"category": "technology", "text": "Facial recognition is used for unlocking phones and surveillance."},
              {"category": "technology", "text": "Voice assistants like Alexa and Siri use Natural Language Processing."},
              {"category": "technology", "text": "NFTs represent ownership of digital assets using blockchain."},
              {"category": "technology", "text": "E-waste is one of the fastest-growing waste streams in the world."},
              {"category": "technology", "text": "Cybersecurity is crucial in protecting online data."},
              {"category": "technology", "text": "3D printing can create objects from digital models."},
              {"category": "technology", "text": "Biometric authentication uses unique physical traits for security."},
              {"category": "technology", "text": "Digital twins are virtual replicas of physical assets."},
              {"category": "technology", "text": "Quantum computing uses superposition to perform calculations faster."},
              {"category": "technology", "text": "Dark mode can reduce battery consumption on OLED screens."},


              
                {"category": "famous inventors", "text": "Thomas Edison invented the phonograph and improved the electric light bulb."},
                {"category": "famous inventors", "text": "Alexander Graham Bell is credited with inventing the first practical telephone."},
                {"category": "famous inventors", "text": "Nikola Tesla developed the AC (alternating current) electrical system."},
                {"category": "famous inventors", "text": "Leonardo da Vinci designed many futuristic inventions, including flying machines."},
                {"category": "famous inventors", "text": "James Watt improved the steam engine, which powered the Industrial Revolution."},
                {"category": "famous inventors", "text": "The Wright brothers, Orville and Wilbur, invented and flew the first powered airplane."},
                {"category": "famous inventors", "text": "Johannes Gutenberg invented the printing press around 1440."},
                {"category": "famous inventors", "text": "Tim Berners-Lee invented the World Wide Web in 1989."},
                {"category": "famous inventors", "text": "Marie Curie pioneered research on radioactivity and won two Nobel Prizes."},
                {"category": "famous inventors", "text": "Benjamin Franklin invented the lightning rod and bifocal glasses."},
                {"category": "famous inventors", "text": "Eli Whitney invented the cotton gin, revolutionizing the textile industry."},
                {"category": "famous inventors", "text": "Karl Benz built the first practical automobile powered by an internal combustion engine."},
                {"category": "famous inventors", "text": "Guglielmo Marconi is known for his work on long-distance radio transmission."},
                {"category": "famous inventors", "text": "Hedy Lamarr co-invented a frequency-hopping spread spectrum used in modern wireless tech."},
                {"category": "famous inventors", "text": "Louis Pasteur developed pasteurization and vaccines for rabies and anthrax."},
                {"category": "famous inventors", "text": "Steve Jobs co-invented the Apple computer and helped revolutionize mobile devices."},
                {"category": "famous inventors", "text": "Grace Hopper developed the first compiler for a computer programming language."},
                {"category": "famous inventors", "text": "Galileo Galilei improved the telescope and supported heliocentric theory."},
                {"category": "famous inventors", "text": "Blaise Pascal invented the Pascaline, an early mechanical calculator."},
                {"category": "famous inventors", "text": "Alessandro Volta invented the electric battery and discovered methane gas."},
                {"category": "famous inventors", "text": "Ada Lovelace is considered the first computer programmer."},
                {"category": "famous inventors", "text": "Philo Farnsworth invented the first fully functional all-electronic television system."},
                {"category": "famous inventors", "text": "Robert Fulton developed the first commercially successful steamboat."},
                {"category": "famous inventors", "text": "George Washington Carver invented over 300 products using peanuts."},
                {"category": "famous inventors", "text": "Rudolf Diesel invented the diesel engine in the 1890s."},
                {"category": "famous inventors", "text": "Samuel Morse developed Morse code and contributed to the invention of the telegraph."},
                {"category": "famous inventors", "text": "Alva Fisher is credited with inventing the first electric washing machine."},
                {"category": "famous inventors", "text": "John Logie Baird invented the first working television system."},
                {"category": "famous inventors", "text": "Baran and Davies developed the concept of packet switching, essential for the internet."},
                {"category": "famous inventors", "text": "Charles Babbage designed the Analytical Engine, an early mechanical general-purpose computer."},
                {"category": "famous inventors", "text": "James Dyson invented the bagless vacuum cleaner using cyclonic separation."},
                {"category": "famous inventors", "text": "Mary Anderson invented the first windshield wiper."},
                {"category": "famous inventors", "text": "Garrett Morgan invented the three-position traffic signal and gas mask."},
                {"category": "famous inventors", "text": "Jonas Salk developed the first successful polio vaccine."},
                {"category": "famous inventors", "text": "Frederick McKinley Jones invented the automatic refrigeration system for trucks."},
                {"category": "famous inventors", "text": "Willis Carrier invented modern air conditioning."},
                {"category": "famous inventors", "text": "Henry Ford developed the assembly line method of mass production for automobiles."},
                {"category": "famous inventors", "text": "Jack Kilby invented the integrated circuit (microchip)."},
                {"category": "famous inventors", "text": "Douglas Engelbart invented the computer mouse."},
                {"category": "famous inventors", "text": "Mark Zuckerberg co-invented Facebook, transforming social media."},
                {"category": "famous inventors", "text": "Larry Page and Sergey Brin co-founded Google and invented PageRank."},
                {"category": "famous inventors", "text": "Vint Cerf is known as a 'father of the internet' for his work on TCP/IP protocols."},
                {"category": "famous inventors", "text": "Shuji Nakamura invented the blue LED, which revolutionized lighting."},
                {"category": "famous inventors", "text": "Elon Musk contributed to the invention and success of electric cars through Tesla."},
                {"category": "famous inventors", "text": "Nolan Bushnell invented the first commercially successful video game, Pong."},
                {"category": "famous inventors", "text": "Margaret Knight invented a machine to create flat-bottomed paper bags."},
                {"category": "famous inventors", "text": "Christopher Sholes invented the QWERTY keyboard layout."},
                {"category": "famous inventors", "text": "John Atanasoff invented the first electronic digital computer."},
                {"category": "famous inventors", "text": "Trevor Baylis invented the wind-up radio, providing communication without electricity."},
                {"category": "famous inventors", "text": "Laszlo Biro invented the modern ballpoint pen."},
                {"category": "famous inventors", "text": "Earle Dickson invented the adhesive bandage, known as Band-Aid."},
                {"category": "famous inventors", "text": "Frank Whittle invented the jet engine independently in the UK."},
                {"category": "famous inventors", "text": "Charles Goodyear discovered the vulcanization process for rubber."},
                {"category": "famous inventors", "text": "Walter Hunt invented the safety pin."},
                {"category": "famous inventors", "text": "Peter Higgs contributed to the theory of the Higgs boson, a fundamental particle."},
                {"category": "famous inventors", "text": "Stephanie Kwolek invented Kevlar, used in bulletproof vests."},
                {"category": "famous inventors", "text": "Robert H. Goddard invented and built the world's first liquid-fueled rocket."},
                {"category": "famous inventors", "text": "Igor Sikorsky invented the first successful helicopter."},
                {"category": "famous inventors", "text": "Yuan Longping developed hybrid rice, significantly boosting food production."},
                {"category": "famous inventors", "text": "John Pemberton invented Coca-Cola in 1886."},
                {"category": "famous inventors", "text": "Alfred Nobel invented dynamite and established the Nobel Prizes."},
                {"category": "famous inventors", "text": "Josephine Cochrane invented the first practical dishwasher."},
                {"category": "famous inventors", "text": "Erno Rubik invented the Rubik's Cube in 1974."},
                {"category": "famous inventors", "text": "George de Mestral invented Velcro after studying burrs stuck to his dog."},
                {"category": "famous inventors", "text": "James Naismith invented the sport of basketball in 1891."},
                {"category": "famous inventors", "text": "David Edward Hughes invented the carbon microphone."},
                {"category": "famous inventors", "text": "Douglas C. Engelbart invented hypertext and graphical user interfaces."},
                {"category": "famous inventors", "text": "Wernher von Braun developed the V-2 rocket and later contributed to NASA's Saturn V."},
                {"category": "famous inventors", "text": "Richard Trevithick built the first full-scale working railway steam locomotive."},
                {"category": "famous inventors", "text": "Paul Nipkow invented the Nipkow disk, a fundamental part of early television technology."},
                {"category": "famous inventors", "text": "John Bardeen won two Nobel Prizes for his work in semiconductors and superconductivity."},
                {"category": "famous inventors", "text": "Rowland Hill invented the modern postal system and the postage stamp."},
                {"category": "famous inventors", "text": "William Shockley co-invented the transistor, a key component in modern electronics."},
                {"category": "famous inventors", "text": "Jan Ernst Matzeliger invented a machine that revolutionized shoe production."},
                {"category": "famous inventors", "text": "Frederick Banting co-discovered insulin, which is vital for diabetes treatment."},
                {"category": "famous inventors", "text": "Whitcomb Judson invented the zipper."},
                {"category": "famous inventors", "text": "Norbert Wiener is considered the father of cybernetics."},
                {"category": "famous inventors", "text": "Emile Berliner invented the gramophone and flat disc records."},



                
                  {
                    "category": "psychology",
                    "text": "The human attention span has decreased to 8 seconds, which is shorter than a goldfish's."
                  },
                  {
                    "category": "psychology",
                    "text": "People are more likely to remember emotionally charged memories."
                  },
                  {
                    "category": "psychology",
                    "text": "Multitasking can reduce productivity by up to 40%."
                  },
                  {
                    "category": "psychology",
                    "text": "Mirror neurons in our brain help us feel empathy by mirroring others' emotions."
                  },
                  {
                    "category": "psychology",
                    "text": "Smiling, even when fake, can improve your mood."
                  },
                  {
                    "category": "psychology",
                    "text": "People tend to remember negative events more vividly than positive ones."
                  },
                  {
                    "category": "psychology",
                    "text": "The placebo effect shows how belief alone can cause real changes in the body."
                  },
                  {
                    "category": "psychology",
                    "text": "First impressions are formed within the first 7 seconds of meeting someone."
                  },
                  {
                    "category": "psychology",
                    "text": "Dopamine is known as the 'feel-good' neurotransmitter."
                  },
                  {
                    "category": "psychology",
                    "text": "People are more likely to conform in a group setting due to peer pressure."
                  },
                  {
                    "category": "psychology",
                    "text": "Music can help reduce anxiety and improve focus."
                  },
                  {
                    "category": "psychology",
                    "text": "Neuroplasticity is the brains ability to rewire itself through learning and experience."
                  },
                  {
                    "category": "psychology",
                    "text": "Color can influence mood; blue can be calming, while red can increase alertness."
                  },
                  {
                    "category": "psychology",
                    "text": "People tend to make decisions based on emotions rather than logic."
                  },
                  {
                    "category": "psychology",
                    "text": "Writing down your thoughts can help reduce stress and anxiety."
                  },
                  {
                    "category": "psychology",
                    "text": "Body language makes up a large percentage of communication."
                  },
                  {
                    "category": "psychology",
                    "text": "Cognitive dissonance occurs when a person holds two conflicting beliefs or behaviors."
                  },
                  {
                    "category": "psychology",
                    "text": "The fear of being without a mobile phone is called nomophobia."
                  },
                  {
                    "category": "psychology",
                    "text": "People with high emotional intelligence are better at handling relationships and stress."
                  },
                  {
                    "category": "psychology",
                    "text": "Memory is not perfect and can be influenced by suggestion or bias."
                  },
                  {
                    "category": "psychology",
                    "text": "People tend to be happier when they spend money on experiences rather than things."
                  },
                  {
                    "category": "psychology",
                    "text": "The brain processes negative words slower than positive ones."
                  },
                  {
                    "category": "psychology",
                    "text": "Decision fatigue can lead to poor choices after a long day of making decisions."
                  },
                  {
                    "category": "psychology",
                    "text": "Introverts and extroverts have different brain chemistry responses to dopamine."
                  },
                  {
                    "category": "psychology",
                    "text": "Laughing increases endorphins, reducing stress and boosting mood."
                  },
                  {
                    "category": "psychology",
                    "text": "Sleep is essential for memory consolidation and emotional regulation."
                  },
                  {
                    "category": "psychology",
                    "text": "People tend to overestimate how much others notice their appearance or behavior."
                  },
                  {
                    "category": "psychology",
                    "text": "The 'halo effect' is when one positive trait influences overall perception of a person."
                  },
                  {
                    "category": "psychology",
                    "text": "People are more likely to agree to a bigger request if theyve first agreed to a smaller one (foot-in-the-door technique)."
                  },
                  {
                    "category": "psychology",
                    "text": "Gratitude practices can increase happiness and reduce depression."
                  },
                  {
                    "category": "psychology",
                    "text": "The brain treats rejection similarly to physical pain."
                  },
                  {
                    "category": "psychology",
                    "text": "Being in nature can significantly improve mental well-being."
                  },
                  {
                    "category": "psychology",
                    "text": "Your brain continues to develop well into your 20s."
                  },
                  {
                    "category": "psychology",
                    "text": "Fear can be learned by observing others."
                  },
                  {
                    "category": "psychology",
                    "text": "Facial expressions are universal across cultures."
                  },
                  {
                    "category": "psychology",
                    "text": "Self-affirmation can improve academic performance and reduce stress."
                  },
                  {
                    "category": "psychology",
                    "text": "People tend to mimic the body language of those they like or trust."
                  },
                  {
                    "category": "psychology",
                    "text": "Visualization can enhance performance in athletes and professionals."
                  },
                  {
                    "category": "psychology",
                    "text": "Procrastination is often linked to fear of failure or perfectionism."
                  },
                  {
                    "category": "psychology",
                    "text": "Smells can trigger powerful memories and emotions."
                  },
                  {
                    "category": "psychology",
                    "text": "Crying releases stress hormones and can make you feel better."
                  },
                  {
                    "category": "psychology",
                    "text": "Physical touch, like hugging, increases oxytocin and reduces cortisol."
                  },
                  {
                    "category": "psychology",
                    "text": "Habits form through repetition and reinforcement over time."
                  },
                  {
                    "category": "psychology",
                    "text": "Mental rehearsal activates the same brain regions as physical practice."
                  },
                  {
                    "category": "psychology",
                    "text": "Trust is built through consistent behavior and reliability."
                  },
                  {
                    "category": "psychology",
                    "text": "The brain can rewire itself after trauma, known as post-traumatic growth."
                  },
                  {
                    "category": "psychology",
                    "text": "People remember unfinished tasks better than completed ones (Zeigarnik effect)."
                  },
                  {
                    "category": "psychology",
                    "text": "Blue light exposure before bed can interfere with sleep quality."
                  },
                  {
                    "category": "psychology",
                    "text": "Rejection activates the same brain pathways as physical pain."
                  },
                  {
                    "category": "psychology",
                    "text": "Social isolation can be as damaging to health as smoking."
                  },
                  {
                    "category": "psychology",
                    "text": "Acts of kindness can increase serotonin and happiness levels."
                  },
                  {
                    "category": "psychology",
                    "text": "FOMO (Fear of Missing Out) is a common psychological phenomenon linked to social media."
                  },
                  {
                    "category": "psychology",
                    "text": "A cluttered environment can increase stress and reduce focus."
                  },
                  {
                    "category": "psychology",
                    "text": "People tend to judge themselves based on intentions but others based on actions."
                  },
                  {
                    "category": "psychology",
                    "text": "Mental health stigma can prevent people from seeking help."
                  },
                  {
                    "category": "psychology",
                    "text": "The mind can confuse imagined experiences with real ones if visualized vividly."
                  },
                  {
                    "category": "psychology",
                    "text": "Social comparison can negatively impact self-esteem."
                  },
                  {
                    "category": "psychology",
                    "text": "Naming emotions can help reduce their intensity."
                  },
                  {
                    "category": "psychology",
                    "text": "Mirror therapy is used to treat phantom limb pain in amputees."
                  },
                  {
                    "category": "psychology",
                    "text": "Introversion and shyness are not the same; introverts recharge alone while shy people fear social judgment."
                  },
                  {
                    "category": "psychology",
                    "text": "The average person has more than 6,000 thoughts per day."
                  },
                  {
                    "category": "psychology",
                    "text": "The brain interprets rejection similarly to a physical injury."
                  },
                  {
                    "category": "psychology",
                    "text": "Positive self-talk can improve performance and motivation."
                  },
                  {
                    "category": "psychology",
                    "text": "Oxytocin plays a key role in social bonding and trust."
                  },
                  {
                    "category": "psychology",
                    "text": "Fear can enhance memory formation for emotional events."
                  },
                  {
                    "category": "psychology",
                    "text": "Mental health affects physical health and vice versa."
                  },


                  {
                    "category": "general knowledge",
                    "text": "The Great Wall of China is more than 13,000 miles long."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Earth orbits the Sun once every 365.25 days."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The human body has 206 bones."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Mount Everest is the highest mountain above sea level, at 8,848 meters (29,029 feet)."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The currency of Japan is the Yen."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Pacific Ocean is the largest and deepest ocean in the world."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Water boils at 100°C (212°F) at sea level."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Light travels at approximately 299,792 kilometers per second."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The capital of Australia is Canberra, not Sydney."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The longest river in the world is the Nile, though some argue it is the Amazon."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The first president of the United States was George Washington."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The largest desert in the world is Antarctica."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The human heart beats around 100,000 times per day."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The smallest country in the world is Vatican City."
                  },
                  {
                    "category": "general knowledge",
                    "text": "A leap year occurs every four years."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Great Pyramid of Giza was built around 2560 BC."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Shakespeare wrote 37 plays during his lifetime."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Albert Einstein developed the theory of relativity."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The tallest building in the world is the Burj Khalifa in Dubai."
                  },
                  {
                    "category": "general knowledge",
                    "text": "There are 7 continents on Earth."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Mona Lisa was painted by Leonardo da Vinci."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The capital of France is Paris."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The freezing point of water is 0°C or 32°F."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The human brain is about 75% water."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Neil Armstrong was the first man to walk on the Moon in 1969."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Honeybees can recognize human faces."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Statue of Liberty was a gift from France to the USA."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Sahara is the largest hot desert in the world."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The invention of the printing press is credited to Johannes Gutenberg."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Elephants are the largest land animals."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The tallest mountain in the solar system is Olympus Mons on Mars."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The pancreas produces insulin."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The capital of Canada is Ottawa."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The internet was invented in the late 1960s and became public in the 1990s."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Moon causes tides on Earth due to gravitational pull."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Amazon Rainforest is known as the lungs of the Earth."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Eiffel Tower was completed in 1889."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Venus is the hottest planet in our solar system."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Thomas Edison is credited with inventing the first practical light bulb."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Earth has one moon."
                  },
                  {
                    "category": "general knowledge",
                    "text": "There are 12 months in a year."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The capital of Italy is Rome."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The chemical symbol for gold is Au."
                  },
                  {
                    "category": "general knowledge",
                    "text": "A triangle has three sides."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The square root of 64 is 8."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The water cycle includes evaporation, condensation, and precipitation."
                  },
                  {
                    "category": "general knowledge",
                    "text": "There are 26 letters in the English alphabet."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The largest mammal is the blue whale."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Bacteria were the first life forms on Earth."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The human body has 46 chromosomes."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Mammals are warm-blooded animals."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The tallest animal in the world is the giraffe."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The capital of Russia is Moscow."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Jupiter is the largest planet in our solar system."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Photosynthesis is the process by which plants make their food."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The human eye can distinguish around 10 million colors."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Leaning Tower of Pisa is located in Italy."
                  },
                  {
                    "category": "general knowledge",
                    "text": "English is the most widely spoken language in the world."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The human skin is the largest organ."
                  },
                  {
                    "category": "general knowledge",
                    "text": "H2O is the chemical formula for water."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Great Barrier Reef is located in Australia."
                  },
                  {
                    "category": "general knowledge",
                    "text": "An octopus has three hearts."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The heart pumps blood throughout the body."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The capital of Egypt is Cairo."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Milky Way is the galaxy that contains our Solar System."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The first computer programmer was Ada Lovelace."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Humans have five basic senses."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Earth’s atmosphere is composed mainly of nitrogen."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The capital of Germany is Berlin."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Sound travels slower than light."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The Pythagorean theorem applies to right-angled triangles."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Mercury is the closest planet to the Sun."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The chemical symbol for oxygen is O."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The longest bone in the human body is the femur."
                  },
                  {
                    "category": "general knowledge",
                    "text": "There are 60 seconds in a minute."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Volcanoes can be found on land and underwater."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Rainbows are formed by reflection, refraction, and dispersion of light."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The liver is the largest internal organ in the human body."
                  },
                  {
                    "category": "general knowledge",
                    "text": "Sharks have been around longer than dinosaurs."
                  },
                  {
                    "category": "general knowledge",
                    "text": "The internet uses a system called IP (Internet Protocol) for communication."
                  },
                  {
                    "category": "fun facts",
                    "text": "A group of flamingos is called a 'flamboyance'."
                  },
                  {
                    "category": "fun facts",
                    "text": "Octopuses have three hearts."
                  },
                  {
                    "category": "fun facts",
                    "text": "Cows have best friends and get stressed when separated."
                  },
                  {
                    "category": "fun facts",
                    "text": "Bananas are berries, but strawberries aren’t."
                  },
                  {
                    "category": "fun facts",
                    "text": "You can't hum while holding your nose closed."
                  },
                  {
                    "category": "fun facts",
                    "text": "Sharks existed before trees."
                  },
                  {
                    "category": "fun facts",
                    "text": "The shortest war in history lasted 38 minutes."
                  },
                  {
                    "category": "fun facts",
                    "text": "There are more stars in the universe than grains of sand on Earth."
                  },
                  {
                    "category": "fun facts",
                    "text": "The Eiffel Tower can grow taller in the summer due to heat expansion."
                  },
                  {
                    "category": "fun facts",
                    "text": "Sloths can hold their breath longer than dolphins."
                  },
                  {
                    "category": "fun facts",
                    "text": "Wombat poop is cube-shaped."
                  },
                  {
                    "category": "fun facts",
                    "text": "A cloud can weigh more than a million pounds."
                  },
                  {
                    "category": "fun facts",
                    "text": "Scotland's national animal is the unicorn."
                  },
                  {
                    "category": "fun facts",
                    "text": "You are taller in the morning than in the evening."
                  },
                  {
                    "category": "fun facts",
                    "text": "A single strand of spaghetti is called a 'spaghetto'."
                  },
                  {
                    "category": "fun facts",
                    "text": "Some cats are allergic to humans."
                  },
                  {
                    "category": "fun facts",
                    "text": "Honey never spoils — archaeologists have found edible 3000-year-old honey."
                  },
                  {
                    "category": "fun facts",
                    "text": "The human nose can detect about 1 trillion smells."
                  },
                  {
                    "category": "fun facts",
                    "text": "Snails can sleep for up to three years."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's a basketball court on the top floor of the U.S. Supreme Court building."
                  },
                  {
                    "category": "fun facts",
                    "text": "Oxford University is older than the Aztec Empire."
                  },
                  {
                    "category": "fun facts",
                    "text": "A day on Venus is longer than a year on Venus."
                  },
                  {
                    "category": "fun facts",
                    "text": "Tigers have striped skin, not just striped fur."
                  },
                  {
                    "category": "fun facts",
                    "text": "Bubble wrap was originally invented to be wallpaper."
                  },
                  {
                    "category": "fun facts",
                    "text": "It rains diamonds on Jupiter and Saturn."
                  },
                  {
                    "category": "fun facts",
                    "text": "Coca-Cola was the first soft drink in space."
                  },
                  {
                    "category": "fun facts",
                    "text": "Some turtles can breathe through their butts."
                  },
                  {
                    "category": "fun facts",
                    "text": "The inventor of the frisbee was turned into a frisbee after he died."
                  },
                  {
                    "category": "fun facts",
                    "text": "You can't lick your elbow—it's physically impossible for most people."
                  },
                  {
                    "category": "fun facts",
                    "text": "Elephants can’t jump."
                  },
                  {
                    "category": "fun facts",
                    "text": "The majority of your brain is fat."
                  },
                  {
                    "category": "fun facts",
                    "text": "The blob of toothpaste on a toothbrush is called a 'nurdle'."
                  },
                  {
                    "category": "fun facts",
                    "text": "Pigeons can tell the difference between Picasso and Monet."
                  },
                  {
                    "category": "fun facts",
                    "text": "The 'M’s' in M&Ms stand for 'Mars' and 'Murrie'."
                  },
                  {
                    "category": "fun facts",
                    "text": "The smell of freshly cut grass is actually a plant distress call."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's a species of jellyfish that can live forever."
                  },
                  {
                    "category": "fun facts",
                    "text": "The inventor of Pringles is buried in a Pringles can."
                  },
                  {
                    "category": "fun facts",
                    "text": "A jiffy is a real unit of time — 1/100th of a second."
                  },
                  {
                    "category": "fun facts",
                    "text": "Penguins propose to their mates with pebbles."
                  },
                  {
                    "category": "fun facts",
                    "text": "A crocodile can't stick out its tongue."
                  },
                  {
                    "category": "fun facts",
                    "text": "A group of crows is called a 'murder'."
                  },
                  {
                    "category": "fun facts",
                    "text": "Humans share about 60% of their DNA with bananas."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's an island in Japan you can visit that's overrun by friendly bunnies."
                  },
                  {
                    "category": "fun facts",
                    "text": "Koalas sleep up to 22 hours a day."
                  },
                  {
                    "category": "fun facts",
                    "text": "Giraffes only need 5–30 minutes of sleep in a 24-hour period."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's a species of ant that explodes when attacked."
                  },
                  {
                    "category": "fun facts",
                    "text": "A bolt of lightning contains enough energy to toast 100,000 slices of bread."
                  },
                  {
                    "category": "fun facts",
                    "text": "Butterflies can taste with their feet."
                  },
                  {
                    "category": "fun facts",
                    "text": "A day on Mercury lasts 1,408 hours."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's a basketball league for people under 5 feet 5 inches tall."
                  },
                  {
                    "category": "fun facts",
                    "text": "The 'French' in French fries actually refers to the method of slicing, not the origin."
                  },
                  {
                    "category": "fun facts",
                    "text": "The voice of Mickey Mouse married the voice of Minnie Mouse in real life."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's a type of fungus that turns ants into zombies."
                  },
                  {
                    "category": "fun facts",
                    "text": "Jellyfish are 95% water."
                  },
                  {
                    "category": "fun facts",
                    "text": "Hot water freezes faster than cold water in some conditions — it's called the Mpemba effect."
                  },
                  {
                    "category": "fun facts",
                    "text": "The dot over a lowercase 'i' or 'j' is called a tittle."
                  },
                  {
                    "category": "fun facts",
                    "text": "Sea otters hold hands when they sleep to keep from drifting apart."
                  },
                  {
                    "category": "fun facts",
                    "text": "The average person walks the equivalent of five times around the world in a lifetime."
                  },
                  {
                    "category": "fun facts",
                    "text": "Your heartbeat changes and mimics the music you listen to."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's a species of fish that can climb waterfalls."
                  },
                  {
                    "category": "fun facts",
                    "text": "A group of porcupines is called a 'prickle'."
                  },
                  {
                    "category": "fun facts",
                    "text": "Squirrels plant thousands of trees each year by forgetting where they buried their acorns."
                  },
                  {
                    "category": "fun facts",
                    "text": "The longest hiccuping spree lasted 68 years."
                  },
                  {
                    "category": "fun facts",
                    "text": "A blue whale’s heart is the size of a small car."
                  },
                  {
                    "category": "fun facts",
                    "text": "Some hummingbirds weigh less than a penny."
                  },
                  {
                    "category": "fun facts",
                    "text": "The unicorn is the national animal of Scotland."
                  },
                  {
                    "category": "fun facts",
                    "text": "There's a museum dedicated entirely to failure in Sweden."
                  },
                  {
                    "category": "fun facts",
                    "text": "Kangaroos can’t walk backward."
                  },
                  {
                    "category": "fun facts",
                    "text": "A group of frogs is called an 'army'."
                  },
                  {
                    "category": "fun facts",
                    "text": "Sunsets on Mars appear blue."
                  },
                  {
                    "category": "fun facts",
                    "text": "You can’t burp in space — the lack of gravity makes it impossible."
                  },
                  {
                    "category": "fun facts",
                    "text": "A shrimp's heart is in its head."
                  },
                  {
                    "category": "fun facts",
                    "text": "The word 'nerd' was first coined by Dr. Seuss."
                  },
                  {
                    "category": "fun facts",
                    "text": "Bees can recognize human faces."
                  },
                  {
                    "category": "fun facts",
                    "text": "There’s a town in Norway called Hell — and it freezes over every winter."
                  },
                  {
                    "category": "fun facts",
                    "text": "Pineapples take about two years to grow."
                  },
                  {
                    "category": "fun facts",
                    "text": "Octopuses have nine brains — one central brain and one in each arm."
                  },
                  {
                    "category": "fun facts",
                    "text": "Wearing headphones for an hour increases the bacteria in your ear by 700 times."
                  },
                  {
                    "category": "fun facts",
                    "text": "The national dish of Japan is curry, not sushi."
                  },
                  {
                    "category": "fun facts",
                    "text": "The most expensive pizza in the world costs over $12,000 and takes 72 hours to make."
                  },
                  


                    {"category": "famous inventors", "text": "Thomas Edison invented the phonograph and improved the electric light bulb."},
                    {"category": "famous inventors", "text": "Alexander Graham Bell is credited with inventing the first practical telephone."},
                    {"category": "famous inventors", "text": "Nikola Tesla developed the AC (alternating current) electrical system."},
                    {"category": "famous inventors", "text": "Leonardo da Vinci designed many futuristic inventions, including flying machines."},
                    {"category": "famous inventors", "text": "James Watt improved the steam engine, which powered the Industrial Revolution."},
                    {"category": "famous inventors", "text": "The Wright brothers, Orville and Wilbur, invented and flew the first powered airplane."},
                    {"category": "famous inventors", "text": "Johannes Gutenberg invented the printing press around 1440."},
                    {"category": "famous inventors", "text": "Tim Berners-Lee invented the World Wide Web in 1989."},
                    {"category": "famous inventors", "text": "Marie Curie pioneered research on radioactivity and won two Nobel Prizes."},
                    {"category": "famous inventors", "text": "Benjamin Franklin invented the lightning rod and bifocal glasses."},
                    {"category": "famous inventors", "text": "Eli Whitney invented the cotton gin, revolutionizing the textile industry."},
                    {"category": "famous inventors", "text": "Karl Benz built the first practical automobile powered by an internal combustion engine."},
                    {"category": "famous inventors", "text": "Guglielmo Marconi is known for his work on long-distance radio transmission."},
                    {"category": "famous inventors", "text": "Hedy Lamarr co-invented a frequency-hopping spread spectrum used in modern wireless tech."},
                    {"category": "famous inventors", "text": "Louis Pasteur developed pasteurization and vaccines for rabies and anthrax."},
                    {"category": "famous inventors", "text": "Steve Jobs co-invented the Apple computer and helped revolutionize mobile devices."},
                    {"category": "famous inventors", "text": "Grace Hopper developed the first compiler for a computer programming language."},
                    {"category": "famous inventors", "text": "Galileo Galilei improved the telescope and supported heliocentric theory."},
                    {"category": "famous inventors", "text": "Blaise Pascal invented the Pascaline, an early mechanical calculator."},
                    {"category": "famous inventors", "text": "Alessandro Volta invented the electric battery and discovered methane gas."},
                    {"category": "famous inventors", "text": "Ada Lovelace is considered the first computer programmer."},
                    {"category": "famous inventors", "text": "Philo Farnsworth invented the first fully functional all-electronic television system."},
                    {"category": "famous inventors", "text": "Robert Fulton developed the first commercially successful steamboat."},
                    {"category": "famous inventors", "text": "George Washington Carver invented over 300 products using peanuts."},
                    {"category": "famous inventors", "text": "Rudolf Diesel invented the diesel engine in the 1890s."},
                    {"category": "famous inventors", "text": "Samuel Morse developed Morse code and contributed to the invention of the telegraph."},
                    {"category": "famous inventors", "text": "Alva Fisher is credited with inventing the first electric washing machine."},
                    {"category": "famous inventors", "text": "John Logie Baird invented the first working television system."},
                    {"category": "famous inventors", "text": "Baran and Davies developed the concept of packet switching, essential for the internet."},
                    {"category": "famous inventors", "text": "Charles Babbage designed the Analytical Engine, an early mechanical general-purpose computer."},
                    {"category": "famous inventors", "text": "James Dyson invented the bagless vacuum cleaner using cyclonic separation."},
                    {"category": "famous inventors", "text": "Mary Anderson invented the first windshield wiper."},
                    {"category": "famous inventors", "text": "Garrett Morgan invented the three-position traffic signal and gas mask."},
                    {"category": "famous inventors", "text": "Jonas Salk developed the first successful polio vaccine."},
                    {"category": "famous inventors", "text": "Frederick McKinley Jones invented the automatic refrigeration system for trucks."},
                    {"category": "famous inventors", "text": "Willis Carrier invented modern air conditioning."},
                    {"category": "famous inventors", "text": "Henry Ford developed the assembly line method of mass production for automobiles."},
                    {"category": "famous inventors", "text": "Jack Kilby invented the integrated circuit (microchip)."},
                    {"category": "famous inventors", "text": "Douglas Engelbart invented the computer mouse."},
                    {"category": "famous inventors", "text": "Mark Zuckerberg co-invented Facebook, transforming social media."},
                    {"category": "famous inventors", "text": "Larry Page and Sergey Brin co-founded Google and invented PageRank."},
                    {"category": "famous inventors", "text": "Vint Cerf is known as a 'father of the internet' for his work on TCP/IP protocols."},
                    {"category": "famous inventors", "text": "Shuji Nakamura invented the blue LED, which revolutionized lighting."},
                    {"category": "famous inventors", "text": "Elon Musk contributed to the invention and success of electric cars through Tesla."},
                    {"category": "famous inventors", "text": "Nolan Bushnell invented the first commercially successful video game, Pong."},
                    {"category": "famous inventors", "text": "Margaret Knight invented a machine to create flat-bottomed paper bags."},
                    {"category": "famous inventors", "text": "Christopher Sholes invented the QWERTY keyboard layout."},
                    {"category": "famous inventors", "text": "John Atanasoff invented the first electronic digital computer."},
                    {"category": "famous inventors", "text": "Trevor Baylis invented the wind-up radio, providing communication without electricity."},
                    {"category": "famous inventors", "text": "Laszlo Biro invented the modern ballpoint pen."},
                    {"category": "famous inventors", "text": "Earle Dickson invented the adhesive bandage, known as Band-Aid."},
                    {"category": "famous inventors", "text": "Frank Whittle invented the jet engine independently in the UK."},
                    {"category": "famous inventors", "text": "Charles Goodyear discovered the vulcanization process for rubber."},
                    {"category": "famous inventors", "text": "Walter Hunt invented the safety pin."},
                    {"category": "famous inventors", "text": "Peter Higgs contributed to the theory of the Higgs boson, a fundamental particle."},
                    {"category": "famous inventors", "text": "Stephanie Kwolek invented Kevlar, used in bulletproof vests."},
                    {"category": "famous inventors", "text": "Robert H. Goddard invented and built the world's first liquid-fueled rocket."},
                    {"category": "famous inventors", "text": "Igor Sikorsky invented the first successful helicopter."},
                    {"category": "famous inventors", "text": "Yuan Longping developed hybrid rice, significantly boosting food production."},
                    {"category": "famous inventors", "text": "John Pemberton invented Coca-Cola in 1886."},
                    {"category": "famous inventors", "text": "Alfred Nobel invented dynamite and established the Nobel Prizes."},
                    {"category": "famous inventors", "text": "Josephine Cochrane invented the first practical dishwasher."},
                    {"category": "famous inventors", "text": "Erno Rubik invented the Rubik's Cube in 1974."},
                    {"category": "famous inventors", "text": "George de Mestral invented Velcro after studying burrs stuck to his dog."},
                    {"category": "famous inventors", "text": "James Naismith invented the sport of basketball in 1891."},
                    {"category": "famous inventors", "text": "David Edward Hughes invented the carbon microphone."},
                    {"category": "famous inventors", "text": "Douglas C. Engelbart invented hypertext and graphical user interfaces."},
                    {"category": "famous inventors", "text": "Wernher von Braun developed the V-2 rocket and later contributed to NASA's Saturn V."},
                    {"category": "famous inventors", "text": "Richard Trevithick built the first full-scale working railway steam locomotive."},
                    {"category": "famous inventors", "text": "Paul Nipkow invented the Nipkow disk, a fundamental part of early television technology."},
                    {"category": "famous inventors", "text": "John Bardeen won two Nobel Prizes for his work in semiconductors and superconductivity."},
                    {"category": "famous inventors", "text": "Rowland Hill invented the modern postal system and the postage stamp."},
                    {"category": "famous inventors", "text": "William Shockley co-invented the transistor, a key component in modern electronics."},
                    {"category": "famous inventors", "text": "Jan Ernst Matzeliger invented a machine that revolutionized shoe production."},
                    {"category": "famous inventors", "text": "Frederick Banting co-discovered insulin, which is vital for diabetes treatment."},
                    {"category": "famous inventors", "text": "Whitcomb Judson invented the zipper."},
                    {"category": "famous inventors", "text": "Norbert Wiener is considered the father of cybernetics."},
                    {"category": "famous inventors", "text": "Emile Berliner invented the gramophone and flat disc records."},


                    
                      { "category": "AI", "text": "AI stands for Artificial Intelligence, the simulation of human intelligence in machines." },
                      { "category": "AI", "text": "Alan Turing is considered one of the fathers of AI." },
                      { "category": "AI", "text": "The Turing Test was designed to measure a machine's ability to exhibit human-like intelligence." },
                      { "category": "AI", "text": "Machine learning is a subset of AI focused on enabling machines to learn from data." },
                      { "category": "AI", "text": "Deep learning uses neural networks with multiple layers to model complex patterns in data." },
                      { "category": "AI", "text": "AI is used in voice assistants like Siri, Alexa, and Google Assistant." },
                      { "category": "AI", "text": "Natural Language Processing (NLP) enables machines to understand and generate human language." },
                      { "category": "AI", "text": "ChatGPT is a conversational AI developed by OpenAI based on transformer architecture." },
                      { "category": "AI", "text": "Reinforcement learning trains AI through rewards and punishments." },
                      { "category": "AI", "text": "AI can beat world champions in games like chess and Go." },
                      { "category": "AI", "text": "IBM's Deep Blue defeated chess champion Garry Kasparov in 1997." },
                      { "category": "AI", "text": "AlphaGo, developed by DeepMind, beat world Go champion Lee Sedol in 2016." },
                      { "category": "AI", "text": "Generative AI creates content like images, text, or music." },
                      { "category": "AI", "text": "AI is used in self-driving cars for perception, decision-making, and control." },
                      { "category": "AI", "text": "Facial recognition systems use AI to identify and verify people." },
                      { "category": "AI", "text": "AI can help detect fraud in banking and finance." },
                      { "category": "AI", "text": "AI is being used in medical diagnostics to detect diseases from images and data." },
                      { "category": "AI", "text": "AI can generate realistic deepfake videos and images." },
                      { "category": "AI", "text": "AI helps in predictive maintenance in industries by analyzing equipment data." },
                      { "category": "AI", "text": "AI is used to recommend products, music, and movies online." },
                      { "category": "AI", "text": "Robots powered by AI are used in manufacturing and warehouses." },
                      { "category": "AI", "text": "Tesla uses AI in its autopilot and Full Self-Driving (FSD) systems." },
                      { "category": "AI", "text": "AI algorithms are behind personalized ads on social media platforms." },
                      { "category": "AI", "text": "Computer vision is a field of AI focused on interpreting visual information." },
                      { "category": "AI", "text": "GPT models are based on the Transformer neural network architecture." },
                      { "category": "AI", "text": "AI is increasingly used in cybersecurity to detect and prevent threats." },
                      { "category": "AI", "text": "AI-powered chatbots are used in customer service to handle queries automatically." },
                      { "category": "AI", "text": "AI can analyze legal documents and assist in legal research." },
                      { "category": "AI", "text": "AI helps translate languages in real-time using models like Google Translate." },
                      { "category": "AI", "text": "AI can generate artwork, mimicking styles of famous painters." },
                      { "category": "AI", "text": "AI is being explored for use in space exploration and autonomous spacecraft." },
                      { "category": "AI", "text": "Edge AI runs AI models on devices like smartphones instead of cloud servers." },
                      { "category": "AI", "text": "AI ethics involves ensuring AI systems are fair, accountable, and transparent." },
                      { "category": "AI", "text": "AI bias can occur if training data contains unfair or unbalanced representations." },
                      { "category": "AI", "text": "Explainable AI (XAI) aims to make AI decisions understandable by humans." },
                      { "category": "AI", "text": "AI models require large datasets for training to be effective." },
                      { "category": "AI", "text": "AI can simulate human emotions in voice and facial expressions." },
                      { "category": "AI", "text": "Autonomous drones use AI to navigate and make decisions in real-time." },
                      { "category": "AI", "text": "AI can compose music in various genres and even mimic famous composers." },
                      { "category": "AI", "text": "Neural networks are inspired by the human brain's structure." },
                      { "category": "AI", "text": "AI can analyze satellite images for disaster response and agriculture." },
                      { "category": "AI", "text": "AI is helping scientists discover new drugs faster using predictive modeling." },
                      { "category": "AI", "text": "AI in gaming enables smarter non-player characters (NPCs)." },
                      { "category": "AI", "text": "AI is used to optimize energy consumption in smart homes and cities." },
                      { "category": "AI", "text": "AI can write news articles and summaries using NLP models." },
                      { "category": "AI", "text": "Synthetic data generated by AI can augment real datasets for training." },
                      { "category": "AI", "text": "GANs (Generative Adversarial Networks) are used to generate synthetic images." },
                      { "category": "AI", "text": "AI can be trained to play video games better than human players." },
                      { "category": "AI", "text": "AI models like DALLE generate images from textual descriptions." },
                      { "category": "AI", "text": "AI is transforming education through personalized learning tools." },
                      { "category": "AI", "text": "AI can detect fake news and misinformation with language analysis." },
                      { "category": "AI", "text": "Quantum AI combines quantum computing with AI algorithms." },
                      { "category": "AI", "text": "AI is assisting in climate modeling and environmental prediction." },
                      { "category": "AI", "text": "AI helps automate repetitive tasks in offices and industries." },
                      { "category": "AI", "text": "AI-powered translators help break language barriers globally." },
                      { "category": "AI", "text": "AI can predict customer behavior and improve marketing strategies." },
                      { "category": "AI", "text": "AI can help detect credit card fraud in real-time." },
                      { "category": "AI", "text": "AI can write code or assist developers using tools like GitHub Copilot." },
                      { "category": "AI", "text": "AI-driven prosthetics adjust to user behavior and improve mobility." },
                      { "category": "AI", "text": "AI can read X-rays and MRI scans with high accuracy." },
                      { "category": "AI", "text": "AI has limitations and can sometimes produce inaccurate or biased results." },
                      { "category": "AI", "text": "AI can help visually impaired people by describing scenes through audio." },
                      { "category": "AI", "text": "AI-generated avatars are used in virtual meetings and content creation." },
                      { "category": "AI", "text": "AI can detect plagiarism and help in academic integrity." },
                      { "category": "AI", "text": "AI in agriculture helps monitor crops, predict yields, and manage resources." },
                      { "category": "AI", "text": "AI is being integrated into wearable devices for health monitoring." },
                      { "category": "AI", "text": "AI-based recommendation engines improve user engagement on websites." },
                      { "category": "AI", "text": "AI can summarize long articles and documents quickly." },
                      { "category": "AI", "text": "Bias in AI systems can have real-world consequences in hiring or policing." },
                      { "category": "AI", "text": "OpenAIs GPT-4 is one of the most advanced language models." },
                      { "category": "AI", "text": "AI is a key technology behind virtual assistants in smartphones and homes." },
                      { "category": "AI", "text": "AI can enhance photos, videos, and audio automatically." },
                      { "category": "AI", "text": "AI-driven financial tools help users make investment decisions." },
                      { "category": "AI", "text": "AI is revolutionizing design tools in fashion and architecture." },
                      { "category": "AI", "text": "AI can detect emotional tone in voice and text." },
                      { "category": "AI", "text": "AI is used in recruitment to screen resumes and assess candidates." },
                      { "category": "AI", "text": "AI simulations can help model pandemic outbreaks and healthcare needs." },
                      { "category": "AI", "text": "AI tools can identify endangered species in wildlife conservation efforts." },
                      { "category": "AI", "text": "AI is being used in journalism to automate reports and gather insights." },
                      { "category": "AI", "text": "AI can recognize handwriting and convert it into digital text." },
                      { "category": "AI", "text": "AI is expected to transform nearly every industry in the coming decades." }
                    

                  

              
          
      
]